karpus2807/esp32-s3/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "esp_system.h"
#include "esp_heap_caps.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include <Arduino.h>
#include <WiFi.h>
#include "esp_wifi.h"
#include "esp_eap_client.h"

#include "cctv_net.h"
#include "cctv_wifi_profiles.h"
#include "cctv_psram.h"
#include "cctv_time_sync.h"
#include <SD_MMC.h>
#include "sdkconfig.h"
#include "board_config.h"
#include "cctv_osd.h"
#include "cctv_platform.h"
#include "cctv_web_control.h"
#include "cctv_ui_log.h"
#include "cctv_dht.h"
#include "cctv_pir.h"
#include "cctv_mqtt.h"
#include "cctv_telemetry.h"
#include <stdlib.h>
#include <time.h>
#include <sys/socket.h>
#include <netinet/tcp.h>
#include <stdarg.h>
#include <Preferences.h>

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

extern bool g_sdReady;
extern String g_lastSavedPath;
extern String g_sdStatusMessage;
extern String g_cameraStatusMessage;
extern String g_recordingStatus;
extern String g_recordingFile;
extern String g_wifiSsid;
extern String g_wifiPass;
extern bool g_wifiEnterprise;
extern String g_wifiIdentity;
extern String g_wifiEapPass;
extern String g_wifiStatus;
extern volatile bool g_wifiScanRequested;
bool saveJpegFrameToSd(String *savedPath = nullptr);
bool saveJpegBufferToSd(const uint8_t *jpegBuf, size_t jpegLen, String *savedPath = nullptr);
bool remountMicroSD();
bool testMicroSD(String *message = nullptr);
size_t clearCaptures(String *message = nullptr);
String listCapturesJson(size_t limit = 20);
void saveWifiConfig();
void clearWifiConfig();
void loadWifiConfig();

static String s_auth_user = "admin";
static String s_auth_pass = "admin";
static String s_auth_session;

// URL-decode a query-parameter value (%XX → char, + → space)
// ESP-IDF httpd_query_key_value() does NOT url-decode automatically.
static String urlDecode(const char *src) {
  String out;
  char hex[3] = {0};
  for (size_t i = 0; src[i]; i++) {
    if (src[i] == '%' && isxdigit((unsigned char)src[i+1]) && isxdigit((unsigned char)src[i+2])) {
      hex[0] = src[i+1]; hex[1] = src[i+2];
      out += (char)strtol(hex, nullptr, 16);
      i += 2;
    } else if (src[i] == '+') {
      out += ' ';
    } else {
      out += src[i];
    }
  }
  return out;
}

static void cctv_auth_load_creds() {
  Preferences p;
  if (!p.begin("cctv_auth", true)) {
    return;
  }
  const String u = p.getString("user", "admin");
  const String pw = p.getString("pass", "admin");
  p.end();
  s_auth_user = u.length() ? u : "admin";
  s_auth_pass = pw.length() ? pw : "admin";
}

static void cctv_auth_save_creds() {
  Preferences p;
  if (!p.begin("cctv_auth", false)) {
    return;
  }
  p.putString("user", s_auth_user);
  p.putString("pass", s_auth_pass);
  p.end();
}

static bool cctv_auth_cookie_session_valid(httpd_req_t *req) {
  if (s_auth_session.length() == 0) {
    return false;
  }
  char cookie[256] = {0};
  if (httpd_req_get_hdr_value_str(req, "Cookie", cookie, sizeof(cookie)) != ESP_OK) {
    return false;
  }
  const String ck(cookie);
  const String token = String("CTVSESSID=") + s_auth_session;
  return ck.indexOf(token) >= 0;
}

static esp_err_t cctv_auth_send_unauthorized(httpd_req_t *req) {
  if (req) {
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_status(req, "401 Unauthorized");
    return httpd_resp_sendstr(req, "{\"ok\":false,\"error\":\"unauthorized\"}");
  }
  return ESP_FAIL;
}

static bool cctv_auth_require(httpd_req_t *req) {
  if (cctv_auth_cookie_session_valid(req)) {
    return true;
  }
  cctv_auth_send_unauthorized(req);
  return false;
}


static void ui_debug_logf(const char *fmt, ...) {
  if (!cctv_ui_log_get()) {
    return;
  }
  char body[256];
  va_list ap;
  va_start(ap, fmt);
  vsnprintf(body, sizeof(body), fmt, ap);
  va_end(ap);
  String line;
  line.reserve(strlen(body) + 28);
  line += "[";
  line += String(millis());
  line += "ms] ";
  line += body;
  if (line.length() == 0 || line[line.length() - 1] != '\n') {
    line += "\n";
  }
  cctv_ui_log_append(line);
}



httpd_handle_t camera_httpd = NULL;



#if defined(LED_GPIO_NUM)
void enable_led(bool en) {
  int duty = en ? led_duty : 0;
  if (duty > CONFIG_LED_MAX_INTENSITY) duty = CONFIG_LED_MAX_INTENSITY;
  ledcWrite(LED_GPIO_NUM, duty);
  log_i("Set LED intensity to %d", duty);
}
#endif

static esp_err_t bmp_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();
#endif
  cctv_camera_lock();
  fb = esp_camera_fb_get();
  if (!fb) {
    cctv_camera_unlock();
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  uint8_t *buf = NULL;
  size_t buf_len = 0;
  bool converted = frame2bmp(fb, &buf, &buf_len);
  esp_camera_fb_return(fb);
  cctv_camera_unlock();
  if (!converted) {
    log_e("BMP Conversion failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  res = httpd_resp_send(req, (const char *)buf, buf_len);
  free(buf);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_end = esp_timer_get_time();
#endif
  log_i("BMP: %llums, %uB", (uint64_t)((fr_end - fr_start) / 1000), buf_len);
  return res;
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len) {
  jpg_chunking_t *j = (jpg_chunking_t *)arg;
  if (!index) {
    j->len = 0;
  }
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK) {
    return 0;
  }
  j->len += len;
  return len;
}

static esp_err_t capture_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_start = esp_timer_get_time();
#endif

  cctv_camera_lock();
#if defined(LED_GPIO_NUM)
  enable_led(true);
  vTaskDelay(150 / portTICK_PERIOD_MS);  // The LED needs to be turned on ~150ms before the call to esp_camera_fb_get()
  fb = esp_camera_fb_get();              // or it won't be visible in the frame. A better way to do this is needed.
  enable_led(false);
#else
  fb = esp_camera_fb_get();
#endif

