karpus2807/esp32-s3/app_httpd.cpp
  if (!fb) {
    cctv_camera_unlock();
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  size_t jpg_len = 0;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  size_t fb_len = 0;
#endif
  if (fb->format == PIXFORMAT_JPEG) {
    jpg_len = fb->len;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = jpg_len;
#endif
    uint8_t *dup = (uint8_t *)heap_caps_malloc(
        jpg_len, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!dup) {
      dup = (uint8_t *)heap_caps_malloc(jpg_len, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    if (!dup) {
      esp_camera_fb_return(fb);
      cctv_camera_unlock();
      return httpd_resp_send_500(req);
    }
    memcpy(dup, fb->buf, jpg_len);
    esp_camera_fb_return(fb);
    fb = nullptr;
    cctv_camera_unlock();
    res = httpd_resp_send(req, (const char *)dup, jpg_len);
    heap_caps_free(dup);
  } else {
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    httpd_resp_send_chunk(req, NULL, 0);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = jchunk.len;
#endif
    esp_camera_fb_return(fb);
    cctv_camera_unlock();
  }
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_end = esp_timer_get_time();
#endif
  log_i("JPG: %uB %ums", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
  return res;
}

// MJPEG over one TCP connection — much lower latency and higher FPS than polling /capture.
// Same lwIP send-buffer tuning as file download (see download_handler); avoid TCP_NODELAY here
// because each frame is several small chunks (boundary + headers + body).
#define STREAM_PART_BOUNDARY "1234567890000000000009876543210"
// Space after ';' helps strict clients (some VLC builds, embedded players).
static const char STREAM_CONTENT_TYPE[] =
    "multipart/x-mixed-replace; boundary=" STREAM_PART_BOUNDARY;

static void tune_stream_socket(httpd_req_t *req) {
  int sockfd = httpd_req_to_sockfd(req);
  if (sockfd < 0) {
    return;
  }
  int sndbuf = 65535;
  (void)setsockopt(sockfd, SOL_SOCKET, SO_SNDBUF, &sndbuf, sizeof(sndbuf));
  // One large chunk per frame — safe to disable Nagle for lower latency to VLC/browser.
  int one = 1;
  setsockopt(sockfd, IPPROTO_TCP, TCP_NODELAY, &one, sizeof(one));
}

// Rolling MJPEG stream FPS (updated from stream_handler, read by /sysinfo).
static portMUX_TYPE s_stream_fps_mux = portMUX_INITIALIZER_UNLOCKED;
static uint32_t s_stream_fps_window_ms = 0;
static uint32_t s_stream_fps_frame_count = 0;
static float s_stream_fps_value = 0.f;

static void stream_fps_on_frame_sent() {
  const uint32_t m = millis();
  portENTER_CRITICAL(&s_stream_fps_mux);
  if (s_stream_fps_window_ms == 0) {
    s_stream_fps_window_ms = m;
  }
  s_stream_fps_frame_count++;
  const uint32_t elapsed = m - s_stream_fps_window_ms;
  if (elapsed >= 1000u && s_stream_fps_frame_count > 0) {
    s_stream_fps_value = (s_stream_fps_frame_count * 1000.f) / (float)elapsed;
    s_stream_fps_window_ms = m;
    s_stream_fps_frame_count = 0;
  }
  portEXIT_CRITICAL(&s_stream_fps_mux);
}

static float stream_fps_get() {
  portENTER_CRITICAL(&s_stream_fps_mux);
  const float v = s_stream_fps_value;
  portEXIT_CRITICAL(&s_stream_fps_mux);
  return v;
}

static esp_err_t stream_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  tune_stream_socket(req);

  esp_err_t res = httpd_resp_set_type(req, STREAM_CONTENT_TYPE);
  if (res != ESP_OK) {
    return res;
  }
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Cache-Control", "no-store, no-cache, must-revalidate");
  httpd_resp_set_hdr(req, "X-Accel-Buffering", "no");
  httpd_resp_set_hdr(req, "Pragma", "no-cache");

  static const char boundary[] = "\r\n--" STREAM_PART_BOUNDARY "\r\n";
  static const char part_tmpl[] = "Content-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n";
  char part_hdr[96];
  // One contiguous buffer per frame (boundary + part headers + JPEG) → one send_chunk;
  // defer free until next frame so lwIP is done reading (fixes black/corrupt MJPEG).
  uint8_t *pending_pkt = nullptr;

  log_i("MJPEG session start (VLC: http://<ip>/mjpeg or /live.mjpg)");

  while (true) {
    if (pending_pkt) {
      heap_caps_free(pending_pkt);
      pending_pkt = nullptr;
    }

    cctv_camera_lock();
    camera_fb_t *fb = esp_camera_fb_get();
    if (!fb) {
      cctv_camera_unlock();
      log_e("Stream: camera capture failed");
      res = ESP_FAIL;
      break;
    }

    if (fb->format != PIXFORMAT_JPEG) {
      log_e("Stream: need JPEG pixformat");
      esp_camera_fb_return(fb);
      cctv_camera_unlock();
      res = ESP_FAIL;
      break;
    }

    if (fb->len == 0) {
      esp_camera_fb_return(fb);
      cctv_camera_unlock();
      continue;
    }

    const uint16_t fb_w = fb->width;
    const uint16_t fb_h = fb->height;
    size_t jpeg_len = fb->len;

    uint8_t *jpeg_copy = (uint8_t *)heap_caps_malloc(
        jpeg_len, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!jpeg_copy) {
      jpeg_copy = (uint8_t *)heap_caps_malloc(jpeg_len, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    if (!jpeg_copy) {
      esp_camera_fb_return(fb);
      cctv_camera_unlock();
      res = ESP_ERR_NO_MEM;
      break;
    }
    memcpy(jpeg_copy, fb->buf, jpeg_len);
    esp_camera_fb_return(fb);
    cctv_camera_unlock();

#if CCTV_ENABLE_FRAME_OSD && CCTV_OSD_ON_STREAM
    (void)cctvStampJpegBottomBar(&jpeg_copy, &jpeg_len, fb_w, fb_h);
#endif

    int hlen = snprintf(part_hdr, sizeof(part_hdr), part_tmpl, (unsigned)jpeg_len);
    if (hlen <= 0 || (size_t)hlen >= sizeof(part_hdr)) {
      heap_caps_free(jpeg_copy);
      res = ESP_FAIL;
      break;
    }

    const size_t bl = strlen(boundary);
    const size_t total = bl + (size_t)hlen + jpeg_len;
    uint8_t *pkt = (uint8_t *)heap_caps_malloc(total, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!pkt) {
      pkt = (uint8_t *)heap_caps_malloc(total, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    if (!pkt) {
      heap_caps_free(jpeg_copy);
      res = ESP_ERR_NO_MEM;
      break;
    }
    memcpy(pkt, boundary, bl);
    memcpy(pkt + bl, part_hdr, (size_t)hlen);
    memcpy(pkt + bl + (size_t)hlen, jpeg_copy, jpeg_len);
    heap_caps_free(jpeg_copy);

    res = httpd_resp_send_chunk(req, (const char *)pkt, total);
    if (res == ESP_OK) {
      pending_pkt = pkt;
      stream_fps_on_frame_sent();
      vTaskDelay(1);
    } else {
      heap_caps_free(pkt);
    }
    if (res != ESP_OK) {
      break;
    }
  }

  if (pending_pkt) {
    heap_caps_free(pending_pkt);
    pending_pkt = nullptr;
  }

  portENTER_CRITICAL(&s_stream_fps_mux);
  s_stream_fps_value = 0.f;
  s_stream_fps_frame_count = 0;
  s_stream_fps_window_ms = 0;
  portEXIT_CRITICAL(&s_stream_fps_mux);

