karpus2807/esp32-s3/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t save_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  String savedPath;
  bool ok = saveJpegFrameToSd(&savedPath);

  String response = "{\"ok\":";
  response += ok ? "true" : "false";
  response += ",\"sdReady\":";
  response += g_sdReady ? "true" : "false";
  response += ",\"path\":\"";
  response += ok ? savedPath : "";
  response += "\"}";

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, response.c_str(), response.length());
}

static esp_err_t storage_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  char *buf = NULL;
  String action;
  String actionMessage = g_sdStatusMessage;
  size_t removed = 0;

  if (httpd_req_get_url_query_len(req) > 0 && parse_get(req, &buf) == ESP_OK) {
    char actionBuf[24] = {0};
    httpd_query_key_value(buf, "action", actionBuf, sizeof(actionBuf) - 1);
    action = actionBuf;
    free(buf);
  }

  if (action == "remount") {
    remountMicroSD();
    actionMessage = g_sdStatusMessage;
  } else if (action == "test") {
    testMicroSD(&actionMessage);
  } else if (action == "wipe") {
    removed = clearCaptures(&actionMessage);
  }

  uint64_t totalMB = g_sdReady ? (SD_MMC.totalBytes() / (1024 * 1024)) : 0;
  uint64_t freeMB  = g_sdReady ? ((SD_MMC.totalBytes() - SD_MMC.usedBytes()) / (1024 * 1024)) : 0;

  String response = "{";
  response += "\"ok\":true,";
  response += "\"sdReady\":";
  response += g_sdReady ? "true" : "false";
  response += ",\"totalMB\":";
  response += String((unsigned long)totalMB);
  response += ",\"freeMB\":";
  response += String((unsigned long)freeMB);
  response += ",\"recordingStatus\":\"";
  response += g_recordingStatus;
  response += "\",\"recordingFile\":\"";
  response += g_recordingFile;
  response += "\",\"message\":\"";
  response += actionMessage;
  response += "\",\"removed\":";
  response += String((unsigned long)removed);
  response += "}";

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, response.c_str(), response.length());
}

static void append_json_escaped(String &json, const String &src) {
  for (size_t i = 0; i < src.length(); ++i) {
    const char c = src[i];
    if (c == '\\') {
      json += "\\\\";
    } else if (c == '"') {
      json += "\\\"";
    } else if (c == '\n') {
      json += "\\n";
    } else if (c == '\r') {
      json += "\\r";
    } else if ((unsigned char)c < 0x20) {
      json += ' ';
    } else {
      json += c;
    }
  }
}

class CctvLinePrint : public Print {
 public:
  explicit CctvLinePrint(String &b) : b_(b) {}
  size_t write(uint8_t c) override {
    b_ += (char)c;
    return 1;
  }

 private:
  String &b_;
};

static esp_err_t api_console_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  if (httpd_req_get_url_query_len(req) < 1) {
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "cmd query required");
    return ESP_FAIL;
  }
  const size_t buf_len = httpd_req_get_url_query_len(req) + 1;
  char *buf = (char *)malloc(buf_len);
  if (!buf || httpd_req_get_url_query_str(req, buf, buf_len) != ESP_OK) {
    free(buf);
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  char cmd[384];
  if (httpd_query_key_value(buf, "cmd", cmd, sizeof(cmd)) != ESP_OK) {
    free(buf);
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "cmd required");
    return ESP_FAIL;
  }
  free(buf);
  // URL-decode the cmd value (%20 → space, + → space, %XX → char)
  {
    char *r = cmd, *w = cmd;
    while (*r) {
      if (*r == '%' && r[1] && r[2]) {
        char hex[3] = { r[1], r[2], 0 };
        *w++ = (char)strtol(hex, nullptr, 16);
        r += 3;
      } else if (*r == '+') {
        *w++ = ' '; r++;
      } else {
        *w++ = *r++;
      }
    }
    *w = '\0';
  }
  String line = String(cmd);
  line.trim();
  if (line.length() == 0) {
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "empty cmd");
    return ESP_FAIL;
  }
  String out;
  CctvLinePrint lp(out);
  cctv_web_control_dispatch(line, lp);
  if (cctv_ui_log_get()) {
    String entry = String("> ") + line + "\n" + out;
    if (entry.length() == 0 || entry.charAt(entry.length() - 1) != '\n') {
      entry += "\n";
    }
    cctv_ui_log_append(entry);
  }
  String json;
  json.reserve(out.length() + (out.length() >> 2u) + 48);
  json = "{\"ok\":true,\"out\":\"";
  append_json_escaped(json, out);
  json += "\"}";
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json.c_str(), json.length());
}

static esp_err_t api_logs_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  if (httpd_req_get_url_query_len(req) > 0) {
    const size_t q_len = httpd_req_get_url_query_len(req) + 1;
    char *qbuf = (char *)malloc(q_len);
    if (qbuf && httpd_req_get_url_query_str(req, qbuf, q_len) == ESP_OK) {
      char v[8];
      if (httpd_query_key_value(qbuf, "enable", v, sizeof(v)) == ESP_OK) {
        cctv_ui_log_set(atoi(v) != 0);
      }
      if (httpd_query_key_value(qbuf, "clear", v, sizeof(v)) == ESP_OK && atoi(v) != 0) {
        cctv_ui_log_clear();
      }
    }
    free(qbuf);
  }
  String snap;
  cctv_ui_log_snapshot(snap);
  String json = "{\"enabled\":";
  json += cctv_ui_log_get() ? "true" : "false";
  json += ",\"text\":\"";
  append_json_escaped(json, snap);
  json += "\"}";
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json.c_str(), json.length());
}

// ────────── IoT / Sensors API ──────────────────────────────────────────────

static esp_err_t iot_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  // Returns live sensor data + config fields
  const CctvMqttConfig &cfg = cctv_mqtt_config();
  String json;
  json.reserve(512);
  json = "{";

  // Live sensor data
  if (cctv_dht_ok()) {
    json += "\"temp\":";  json += String(cctv_dht_temperature(), 1);
    json += ",\"hum\":";  json += String(cctv_dht_humidity(), 1);
  } else {
    json += "\"temp\":null,\"hum\":null";
  }
  json += ",\"dhtOk\":";       json += cctv_dht_ok() ? "true" : "false";
  json += ",\"dhtStatus\":\""; json += cctv_dht_status_str(); json += "\"";
  json += ",\"pirAlert\":";    json += cctv_pir_alert() ? "true" : "false";
  json += ",\"pirAgeS\":";     json += String(cctv_pir_last_trigger_age_s());
  json += ",\"alertLevel\":";  json += String(cctv_telemetry_alert_level());
  json += ",\"mqttConnected\":"; json += cctv_mqtt_connected() ? "true" : "false";
  json += ",\"mqttStatus\":\"";  json += cctv_mqtt_status_str(); json += "\"";

  // Config fields
  json += ",\"server\":\"";   json += cfg.server; json += "\"";
  json += ",\"port\":";       json += String(cfg.port);
  json += ",\"token\":\"";    json += cfg.token; json += "\"";
  json += ",\"deviceId\":\""; json += cfg.deviceId; json += "\"";
  json += ",\"interval\":";   json += String(cfg.pushIntervalS);
  json += ",\"warnTemp\":";   json += String(cfg.warnTemp, 1);
  json += ",\"criticalTemp\":"; json += String(cfg.criticalTemp, 1);
  json += ",\"alertTemp\":";  json += String(cfg.alertTemp, 1);

  json += "}";
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json.c_str(), json.length());
}

static esp_err_t iot_save_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  CctvMqttConfig &cfg = cctv_mqtt_config();
  const size_t q_len = httpd_req_get_url_query_len(req) + 1;
  if (q_len <= 1) {
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_send(req, "{\"ok\":false,\"msg\":\"no params\"}", -1);
  }
  char *qbuf = (char *)malloc(q_len);
  if (!qbuf) {
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_send(req, "{\"ok\":false,\"msg\":\"alloc\"}", -1);
  }
  httpd_req_get_url_query_str(req, qbuf, q_len);

  char val[128];
  if (httpd_query_key_value(qbuf, "server", val, sizeof(val)) == ESP_OK)
    strlcpy(cfg.server, val, sizeof(cfg.server));
  if (httpd_query_key_value(qbuf, "port", val, sizeof(val)) == ESP_OK)
    cfg.port = (uint16_t)atoi(val);
  if (httpd_query_key_value(qbuf, "token", val, sizeof(val)) == ESP_OK)
    strlcpy(cfg.token, val, sizeof(cfg.token));
  if (httpd_query_key_value(qbuf, "deviceId", val, sizeof(val)) == ESP_OK)
    strlcpy(cfg.deviceId, val, sizeof(cfg.deviceId));
  if (httpd_query_key_value(qbuf, "interval", val, sizeof(val)) == ESP_OK)
    cfg.pushIntervalS = (uint16_t)atoi(val);
  if (httpd_query_key_value(qbuf, "warnTemp", val, sizeof(val)) == ESP_OK)
    cfg.warnTemp = atof(val);
  if (httpd_query_key_value(qbuf, "criticalTemp", val, sizeof(val)) == ESP_OK)
    cfg.criticalTemp = atof(val);
  if (httpd_query_key_value(qbuf, "alertTemp", val, sizeof(val)) == ESP_OK)
    cfg.alertTemp = atof(val);

  free(qbuf);
  cctv_mqtt_save_config();

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, "{\"ok\":true}", -1);
}

static esp_err_t auth_status_handler(httpd_req_t *req) {
  const bool ok = cctv_auth_cookie_session_valid(req);
  String j = "{\"ok\":true,\"loggedIn\":";
  j += ok ? "true" : "false";
  j += ",\"user\":\"";
  append_json_escaped(j, s_auth_user);
  j += "\"}";
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, j.c_str(), j.length());
}

static esp_err_t auth_login_handler(httpd_req_t *req) {
  char *buf = nullptr;
  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }
  char u[96] = {0};
  char p[128] = {0};
  if (httpd_query_key_value(buf, "u", u, sizeof(u)) != ESP_OK ||
      httpd_query_key_value(buf, "p", p, sizeof(p)) != ESP_OK) {
    free(buf);
    httpd_resp_set_status(req, "400 Bad Request");
    return httpd_resp_sendstr(req, "{\"ok\":false,\"error\":\"missing credentials\"}");
  }
  const String user = urlDecode(u);
  const String pass = urlDecode(p);
  free(buf);
  if (user != s_auth_user || pass != s_auth_pass) {
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_status(req, "401 Unauthorized");
    return httpd_resp_sendstr(req, "{\"ok\":false,\"error\":\"invalid user/password\"}");
  }

  char sid[40];
  snprintf(sid, sizeof(sid), "%08lx%08lx%08lx",
           (unsigned long)esp_random(),
           (unsigned long)esp_random(),
           (unsigned long)millis());
  s_auth_session = sid;
  String ck = "CTVSESSID=" + s_auth_session + "; Path=/; HttpOnly; SameSite=Lax";
  httpd_resp_set_hdr(req, "Set-Cookie", ck.c_str());
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_sendstr(req, "{\"ok\":true}");
}

static esp_err_t auth_logout_handler(httpd_req_t *req) {
  s_auth_session = "";
  httpd_resp_set_hdr(req, "Set-Cookie", "CTVSESSID=; Path=/; Max-Age=0; HttpOnly; SameSite=Lax");
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_sendstr(req, "{\"ok\":true}");
}

