karpus2807/esp32-s3/app_httpd.cpp
static esp_err_t auth_change_password_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) {
    return ESP_FAIL;
  }
  char *buf = nullptr;
  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }
  char oldp[128] = {0};
  char newp[128] = {0};
  if (httpd_query_key_value(buf, "old", oldp, sizeof(oldp)) != ESP_OK ||
      httpd_query_key_value(buf, "newp", newp, sizeof(newp)) != ESP_OK) {
    free(buf);
    httpd_resp_set_status(req, "400 Bad Request");
    return httpd_resp_sendstr(req, "{\"ok\":false,\"error\":\"old/new required\"}");
  }
  const String oldPass = urlDecode(oldp);
  const String newPass = urlDecode(newp);
  free(buf);
  if (oldPass != s_auth_pass) {
    httpd_resp_set_status(req, "401 Unauthorized");
    return httpd_resp_sendstr(req, "{\"ok\":false,\"error\":\"old password mismatch\"}");
  }
  if (newPass.length() < 4) {
    httpd_resp_set_status(req, "400 Bad Request");
    return httpd_resp_sendstr(req, "{\"ok\":false,\"error\":\"new password too short\"}");
  }
  s_auth_pass = newPass;
  cctv_auth_save_creds();
  return httpd_resp_sendstr(req, "{\"ok\":true}");
}

static esp_err_t index_handler(httpd_req_t *req) {
  if (!cctv_auth_cookie_session_valid(req)) {
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store");
    static const char *login_html = R"rawliteral(
<!DOCTYPE html><html><head><meta charset="utf-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>Device Login</title>
<style>body{margin:0;background:#0f172a;color:#e2e8f0;font-family:system-ui,sans-serif;display:grid;place-items:center;min-height:100vh}
.c{width:min(92vw,360px);background:#1e293b;border:1px solid #334155;border-radius:12px;padding:16px}
h1{font-size:1rem;margin:0 0 10px 0}.i{width:100%;padding:10px;margin:6px 0;background:#0f172a;color:#e2e8f0;border:1px solid #334155;border-radius:8px}
button{width:100%;padding:10px;border:0;border-radius:8px;background:#3b82f6;color:#fff;font-weight:700;cursor:pointer}
#m{font-size:.82rem;color:#fca5a5;min-height:18px;margin-top:8px}</style></head><body>
<div class="c"><h1>ESP32 CCTV Login</h1><input id="u" class="i" value="admin" placeholder="Username"><input id="p" class="i" type="password" placeholder="Password">
<button onclick="go()">Login</button><div id="m"></div></div>
<script>async function go(){const u=document.getElementById('u').value.trim();const p=document.getElementById('p').value;
const m=document.getElementById('m');m.textContent='';if(!u||!p){m.textContent='Enter username/password';return;}
try{const r=await fetch('/api/auth/login?u='+encodeURIComponent(u)+'&p='+encodeURIComponent(p));const j=await r.json();
if(j&&j.ok){location.href='/';}else{m.textContent=(j&&j.error)?j.error:'Login failed';}}catch(e){m.textContent='Error: '+e.message;}}</script>
</body></html>)rawliteral";
    return httpd_resp_sendstr(req, login_html);
  }
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  const char *html = R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>ESP32-S3 CCTV</title>
<style>
*{box-sizing:border-box;margin:0;padding:0}
body{font-family:system-ui,sans-serif;background:#0f172a;color:#e2e8f0;min-height:100vh}
.c{max-width:920px;margin:0 auto;padding:16px}
h1{font-size:1.4rem;font-weight:700;color:#f8fafc;margin-bottom:3px}
.sub{font-size:.82rem;color:#64748b;margin-bottom:16px}
.grid{display:grid;grid-template-columns:1fr 1fr;gap:12px;margin-bottom:12px}
.grid3{display:grid;grid-template-columns:1fr 1fr 1fr;gap:12px;margin-bottom:12px}
.card{background:#1e293b;border:1px solid #334155;border-radius:12px;padding:14px}
.card h2{font-size:.76rem;font-weight:700;color:#64748b;text-transform:uppercase;letter-spacing:.06em;margin-bottom:10px}
.row{display:flex;justify-content:space-between;align-items:center;padding:5px 0;border-bottom:1px solid #0f172a;font-size:.84rem}
.row:last-child{border-bottom:none}
.lbl{color:#94a3b8}
.badge{display:inline-block;padding:2px 9px;border-radius:20px;font-size:.72rem;font-weight:700}
.g{background:#166534;color:#86efac}.r{background:#7f1d1d;color:#fca5a5}.y{background:#713f12;color:#fde68a}.b{background:#1e3a5f;color:#93c5fd}
.btns{display:grid;grid-template-columns:repeat(auto-fill,minmax(140px,1fr));gap:8px;margin-top:0}
button{padding:9px 14px;border:none;border-radius:8px;font-size:.82rem;font-weight:600;cursor:pointer;transition:opacity .15s}
button:hover{opacity:.82}
.bp{background:#3b82f6;color:#fff}.bd{background:#ef4444;color:#fff}.bn{background:#334155;color:#e2e8f0}.bw{background:#0ea5e9;color:#fff}
.sm{padding:5px 10px;font-size:.76rem;border-radius:6px}
#msg{margin-top:8px;font-size:.8rem;color:#94a3b8;min-height:16px}
.ftbl{width:100%;border-collapse:collapse}
.ftbl th{padding:7px 12px;text-align:left;font-size:.7rem;color:#64748b;text-transform:uppercase;letter-spacing:.05em;background:#0f172a;position:sticky;top:0;z-index:1}
.ftbl td{padding:8px 12px;font-size:.8rem;border-top:1px solid #1e293b}
.ftbl tr:hover td{background:#1e293b88}
.mono{font-family:monospace;font-size:.76rem}
.acts{display:flex;gap:5px;flex-wrap:wrap}
.empty{text-align:center;padding:36px;color:#475569;font-size:.85rem}
.fhdr{padding:10px 14px;border-bottom:1px solid #334155;display:flex;justify-content:space-between;align-items:center}
.fscroll{max-height:340px;overflow-y:auto}
.panel-grid{display:grid;grid-template-columns:1fr 1fr;gap:8px;margin-bottom:10px}
.panel-grid .full{grid-column:1/-1}
.inp-lbl{font-size:.75rem;color:#94a3b8;display:block;margin-bottom:3px}
.inp{width:100%;background:#0f172a;border:1px solid #334155;color:#e2e8f0;border-radius:6px;padding:7px 10px;font-size:.82rem}
.inp:focus{outline:none;border-color:#3b82f6}
.pnl-msg{margin-top:6px;font-size:.78rem;color:#94a3b8;min-height:14px}
.toast{position:fixed;bottom:18px;right:18px;background:#1e293b;border:1px solid #334155;border-radius:8px;padding:10px 16px;font-size:.82rem;opacity:0;transition:opacity .3s;pointer-events:none;z-index:99}
.toast.show{opacity:1}
.preview-wrap{position:relative;width:100%;background:#000;border-radius:10px;overflow:hidden;min-height:180px;display:flex;align-items:center;justify-content:center}
#prevImg{width:100%;display:block;border-radius:10px;max-height:340px;object-fit:contain}
.prev-off{position:absolute;color:#475569;font-size:.85rem;text-align:center}
/* CPU/RAM bar */
.bar-wrap{background:#0f172a;border-radius:4px;height:8px;overflow:hidden;margin-top:4px}
.bar-fill{height:8px;border-radius:4px;transition:width .5s}
.bar-cpu{background:#f59e0b}
.bar-ram{background:#3b82f6}
@media(max-width:580px){.grid{grid-template-columns:1fr}.grid3{grid-template-columns:1fr}.panel-grid{grid-template-columns:1fr}.panel-grid .full{grid-column:1}}
</style>
</head>
<body>
<div class="c">
  <h1>&#128247; ESP32-S3 CCTV Recorder</h1>
  <div style="display:flex;gap:8px;justify-content:flex-end;margin-bottom:10px">
    <button class="bn sm" onclick="authChangePass()">Change Password</button>
    <button class="bd sm" onclick="authLogout()">Logout</button>
  </div>
  <div id="deviceClockRow" style="margin-bottom:10px;padding:8px 12px;background:#0f172a;border:1px solid #334155;border-radius:8px;display:flex;align-items:center;justify-content:space-between;flex-wrap:wrap;gap:8px">
    <span style="font-size:.72rem;font-weight:700;color:#64748b;text-transform:uppercase;letter-spacing:.06em">Device time</span>
    <span id="deviceClock" class="mono" style="font-size:1.05rem;font-weight:700;color:#7dd3fc">--</span>
  </div>
  <p class="sub" id="ipLbl">Loading...</p>

  <!-- Live Preview -->
  <div class="card" style="margin-bottom:12px">
    <div style="display:flex;justify-content:space-between;align-items:center;margin-bottom:10px">
      <h2 style="margin:0">&#128065; Live Preview</h2>
      <div style="display:flex;gap:8px;align-items:center">
        <span id="prevFps" style="font-size:.75rem;color:#64748b"></span>
        <button id="prevToggle" class="bn sm" onclick="togglePreview()">&#9654; Start</button>
      </div>
    </div>
    <div class="preview-wrap">
      <img id="prevImg" alt="" style="display:none">
      <div class="prev-off" id="prevOff">Preview off &mdash; click Start</div>
    </div>
  </div>

