karpus2807/esp32-s3/app_httpd.cpp
  <!-- Status grid -->
  <div class="grid" style="margin-bottom:12px">
    <div class="card">
      <h2>Recording</h2>
      <div class="row"><span class="lbl">Status</span><span id="recBadge" class="badge y">&#8226; Connecting</span></div>
      <div class="row"><span class="lbl">Current file</span><span id="recFile" class="mono" style="color:#94a3b8;max-width:60%;overflow:hidden;text-overflow:ellipsis;white-space:nowrap">-</span></div>
    </div>
    <div class="card">
      <h2>Storage</h2>
      <div class="row"><span class="lbl">SD card</span><span id="sdBadge" class="badge y">-</span></div>
      <div class="row"><span class="lbl">Free / Total</span><span id="sdSpace" style="font-weight:600">-</span></div>
      <div class="row"><span class="lbl">WiFi</span><span id="wifiBadge" class="badge y">-</span></div>
      <div class="row"><span class="lbl">Clock</span><span id="timeBadge" class="badge y">-</span></div>
      <div class="row"><span class="lbl">Device Time</span><span id="deviceTime" style="font-size:.82rem;color:#94a3b8">-</span></div>
    </div>
  </div>

  <!-- CPU / RAM -->
  <div class="grid3" style="margin-bottom:12px">
    <div class="card">
      <h2>CPU Usage</h2>
      <div style="display:flex;justify-content:space-between;font-size:.82rem;margin-bottom:2px">
        <span class="lbl">Core 0</span><span id="cpu0Pct" style="color:#f59e0b;font-weight:700">-</span>
      </div>
      <div class="bar-wrap"><div class="bar-fill bar-cpu" id="cpu0Bar" style="width:0%"></div></div>
      <div style="display:flex;justify-content:space-between;font-size:.82rem;margin-top:6px;margin-bottom:2px">
        <span class="lbl">Core 1</span><span id="cpu1Pct" style="color:#f59e0b;font-weight:700">-</span>
      </div>
      <div class="bar-wrap"><div class="bar-fill bar-cpu" id="cpu1Bar" style="width:0%"></div></div>
    </div>
    <div class="card">
      <h2>RAM (Heap)</h2>
      <div style="display:flex;justify-content:space-between;font-size:.82rem;margin-bottom:2px">
        <span class="lbl">Free</span><span id="ramFree" style="color:#3b82f6;font-weight:700">-</span>
      </div>
      <div class="bar-wrap"><div class="bar-fill bar-ram" id="ramBar" style="width:0%"></div></div>
      <div style="font-size:.75rem;color:#64748b;margin-top:5px">
        Total: <span id="ramTotal">-</span> &nbsp; Min: <span id="ramMin">-</span>
      </div>
    </div>
    <div class="card">
      <h2>PSRAM</h2>
      <div style="display:flex;justify-content:space-between;font-size:.82rem;margin-bottom:2px">
        <span class="lbl">Free</span><span id="psramFree" style="color:#a78bfa;font-weight:700">-</span>
      </div>
      <div class="bar-wrap"><div class="bar-fill" style="background:#7c3aed" id="psramBar" style="width:0%"></div></div>
      <div style="font-size:.75rem;color:#64748b;margin-top:5px">
        Total: <span id="psramTotal">-</span>
      </div>
    </div>
  </div>

  <!-- WiFi Config -->
  <div class="card" style="margin-bottom:12px">
    <div style="display:flex;justify-content:space-between;align-items:center;margin-bottom:4px">
      <h2 style="margin:0">&#128246; WiFi</h2>
      <div style="display:flex;gap:6px">
        <button class="bn sm" id="wifiOnOffBtn" onclick="toggleWifiRadio()">WiFi ON</button>
        <button class="bn sm" onclick="togglePanel('wifiPanel',loadWifiConfig)">&#9881; Configure</button>
      </div>
    </div>
    <div id="wifiStatusRow" style="font-size:.8rem;color:#94a3b8;margin-top:4px">-</div>
    <div id="wifiPanel" style="display:none;margin-top:10px">
      <div class="panel-grid">
        <div class="full">
          <label class="inp-lbl">Mode</label>
          <div style="display:flex;gap:10px;margin-bottom:6px">
            <label style="font-size:.82rem;cursor:pointer"><input type="radio" name="wMode" value="0" onchange="wModeChange(0)" checked> Normal (WPA/WPA2/WPA3-Personal)</label>
            <label style="font-size:.82rem;cursor:pointer"><input type="radio" name="wMode" value="1" onchange="wModeChange(1)"> Enterprise (WPA-EAP / LDAP)</label>
          </div>
        </div>
        <div class="full" id="scanResultsRow" style="display:none">
          <label class="inp-lbl">Scan Results &mdash; click to select</label>
          <div id="scanResults" style="background:#0f172a;border:1px solid #334155;border-radius:6px;max-height:180px;overflow-y:auto;font-size:.78rem"></div>
        </div>
        <div class="full"><label class="inp-lbl">SSID (Network Name)</label>
          <div style="display:flex;gap:6px">
            <input id="wSsid" class="inp" type="text" placeholder="YourSSID" style="flex:1">
            <button class="bn sm" onclick="scanWifi()" id="scanBtn">&#128225; Scan</button>
          </div>
        </div>
        <div id="wPassRow"><label class="inp-lbl">Password</label><input id="wPass" class="inp" type="password" placeholder="(blank = keep current)"></div>
        <div id="wIdentRow" style="display:none"><label class="inp-lbl">LDAP Username (Identity)</label><input id="wIdent" class="inp" type="text" placeholder="user@domain.com"></div>
        <div id="wEapPassRow" style="display:none"><label class="inp-lbl">LDAP Password</label><input id="wEapPass" class="inp" type="password" placeholder="(blank = keep current)"></div>
        <div class="full">
          <label class="inp-lbl">Save to profile slot (up to 3 networks; device tries preferred first, then others)</label>
          <select id="wSlot" class="inp" style="max-width:220px">
            <option value="0">Slot 1 (primary)</option>
            <option value="1">Slot 2</option>
            <option value="2">Slot 3</option>
          </select>
        </div>
        <div class="full">
          <label class="inp-lbl">Saved profiles</label>
          <div id="wifiProfList" style="font-size:.78rem;background:#0f172a;border:1px solid #334155;border-radius:6px;padding:8px;min-height:2.5rem"></div>
        </div>
      </div>
      <div style="display:flex;gap:8px;flex-wrap:wrap">
        <button class="bw sm" onclick="saveWifi(false)">&#10003; Save Config</button>
        <button class="bp sm" onclick="saveWifi(true)">&#8635; Save &amp; Reconnect</button>
        <button class="bd sm" onclick="clearWifiCfg()">&#128465; Clear WiFi</button>
      </div>
      <div class="pnl-msg" id="wifiMsg"></div>
    </div>
  </div>

  <!-- Controls -->
  <div class="card" style="margin-bottom:12px">
    <h2>Controls</h2>
    <div class="btns">
      <button class="bp" onclick="saveSnap()">&#128247; Snapshot</button>
      <button class="bn" onclick="sdAct('remount')">&#8635; Re-mount SD</button>
      <button class="bn" onclick="sdAct('test')">&#10003; Test SD</button>
      <button class="bd" onclick="if(confirm('Delete ALL recordings?'))sdAct('wipe')">&#128465; Wipe All</button>
      <button class="bd" onclick="rebootDevice()">&#9211; Reboot</button>
    </div>
    <div id="msg"></div>
  </div>

  <!-- Device control (serial commands via HTTP) -->
  <div class="card" style="margin-bottom:12px">
    <h2 style="margin-bottom:6px">&#9881; Device control</h2>
    <p style="font-size:.78rem;color:#94a3b8;margin:0 0 8px 0">One line per command (same as old Serial). Run <b>wifiscan</b> before <b>12 norm pass:...</b> style joins.</p>
    <div style="display:flex;flex-wrap:wrap;gap:6px;margin-bottom:10px">
      <button type="button" class="bn sm" onclick="devQuick('wifistatus')">WiFi status</button>
      <button type="button" class="bn sm" onclick="devQuick('devstatus')">Device status</button>
      <button type="button" class="bn sm" onclick="devQuick('wifiscan')">WiFi scan</button>
      <button type="button" class="bn sm" onclick="devQuick('ethdhcp')">ETH DHCP</button>
      <button type="button" class="bn sm" onclick="devQuick('ethstatic')">ETH static (10.0.0.20)</button>
      <button type="button" class="bn sm" onclick="devQuick('timeurl')">Time URL</button>
      <button type="button" class="bn sm" onclick="devQuick('clearwifi')">Clear WiFi</button>
      <button type="button" class="bn sm" onclick="devQuick('wifiprofiles')">WiFi profiles</button>
      <button type="button" class="bd sm" onclick="devQuick('reboot')">Reboot</button>
    </div>
    <label class="inp-lbl">Command</label>
    <input id="devCmdIn" class="inp" type="text" maxlength="360" placeholder="wifiprofiles / wifidel 0 / ethstatic …" autocomplete="off">
    <div style="display:flex;flex-wrap:wrap;gap:8px;align-items:center;margin-top:10px">
      <button type="button" class="bp sm" onclick="devRun()">Run command</button>
      <label style="font-size:.8rem;cursor:pointer;display:flex;align-items:center;gap:6px">
        <input type="checkbox" id="devLogEn" onchange="devLogToggle()"> Session log (~16KB RAM, polled)</label>
      <button type="button" class="bn sm" id="devLogClr" style="display:none" onclick="devLogClear()">Clear log</button>
    </div>
    <pre id="devOut" class="mono" style="display:none;margin-top:10px;background:#0f172a;border:1px solid #334155;border-radius:6px;padding:10px;font-size:.72rem;max-height:180px;overflow:auto;white-space:pre-wrap;color:#cbd5e1"></pre>
    <div id="devLogWrap" style="display:none;margin-top:10px">
      <div style="font-size:.75rem;color:#64748b;margin-bottom:4px">Session log</div>
      <pre id="devLogView" class="mono" style="background:#0f172a;border:1px solid #334155;border-radius:6px;padding:10px;font-size:.72rem;max-height:220px;overflow:auto;white-space:pre-wrap;color:#94a3b8"></pre>
    </div>
  </div>

  <!-- Live debug (actual backend diagnostics) -->
  <div class="card" style="margin-bottom:12px">
    <h2 style="margin-bottom:6px">&#128295; Live Debug</h2>
    <p style="font-size:.78rem;color:#94a3b8;margin:0 0 8px 0">Shows real backend responses (scan/connect/profile switch/console) with timestamps.</p>
    <div style="display:flex;gap:8px;flex-wrap:wrap;align-items:center;margin-bottom:8px">
      <button type="button" class="bn sm" id="dbgPauseBtn" onclick="dbgTogglePause()">Start</button>
      <button type="button" class="bd sm" onclick="dbgClear()">Clear</button>
      <span id="dbgState" style="font-size:.75rem;color:#64748b">Off</span>
    </div>
    <pre id="dbgOut" class="mono" style="margin-top:0;background:#0f172a;border:1px solid #334155;border-radius:6px;padding:10px;font-size:.72rem;max-height:220px;overflow:auto;white-space:pre-wrap;color:#cbd5e1"></pre>
  </div>

