karpus2807/esp32-s3/app_httpd.cpp
  <!-- IoT / Sensors -->
  <div class="card" style="margin-bottom:12px">
    <div style="display:flex;justify-content:space-between;align-items:center;margin-bottom:4px">
      <h2 style="margin:0">&#127777; IoT &amp; Sensors</h2>
      <button class="bn sm" onclick="togglePanel('iotPanel',loadIotConfig)">&#9881; Configure</button>
    </div>
    <div class="grid" style="margin-top:10px;margin-bottom:0">
      <div>
        <div class="row"><span class="lbl">Temperature</span><span id="iotTemp" style="font-weight:600">--</span></div>
        <div class="row"><span class="lbl">Humidity</span><span id="iotHum" style="font-weight:600">--</span></div>
        <div class="row"><span class="lbl">DHT Status</span><span id="iotDhtSt" class="badge y">--</span></div>
      </div>
      <div>
        <div class="row"><span class="lbl">PIR Motion</span><span id="iotPir" class="badge y">--</span></div>
        <div class="row"><span class="lbl">Alert Level</span><span id="iotAlert" class="badge y">--</span></div>
        <div class="row"><span class="lbl">MQTT</span><span id="iotMqtt" class="badge y">--</span></div>
      </div>
    </div>
    <div class="grid" style="margin-top:6px;margin-bottom:0">
      <div>
      </div>
      <div>
        <div class="row"><span class="lbl">Last PIR</span><span id="iotPirAge" style="font-size:.78rem;color:#94a3b8">--</span></div>
      </div>
    </div>
    <div id="iotPanel" style="display:none;margin-top:10px">
      <div class="panel-grid">
        <div><label class="inp-lbl">MQTT Server</label><input id="iotSrv" class="inp" type="text" placeholder="thingsboard.ipserver.in"></div>
        <div><label class="inp-lbl">Port</label><input id="iotPort" class="inp" type="number" placeholder="1883"></div>
        <div class="full"><label class="inp-lbl">Device Access Token</label><input id="iotTok" class="inp" type="text" placeholder="ThingsBoard device token"></div>
        <div><label class="inp-lbl">Device ID</label><input id="iotDev" class="inp" type="text" placeholder="esp32-s3-cctv"></div>
        <div><label class="inp-lbl">Push Interval (s)</label><input id="iotIntv" class="inp" type="number" placeholder="10"></div>
        <div><label class="inp-lbl">Warn Temp (&deg;C)</label><input id="iotWarnT" class="inp" type="number" step="0.1" placeholder="40"></div>
        <div><label class="inp-lbl">Critical Temp (&deg;C)</label><input id="iotCritT" class="inp" type="number" step="0.1" placeholder="50"></div>
        <div><label class="inp-lbl">Alert Temp (&deg;C)</label><input id="iotAlrtT" class="inp" type="number" step="0.1" placeholder="35"></div>
      </div>
      <div style="display:flex;gap:8px;flex-wrap:wrap">
        <button class="bw sm" onclick="saveIotConfig()">&#10003; Save IoT Config</button>
      </div>
      <div class="pnl-msg" id="iotMsg"></div>
    </div>
  </div>

  <!-- File list -->
  <div class="card" style="padding:0;overflow:hidden">
    <div class="fhdr">
      <h2 style="margin:0">Recorded Files</h2>
      <button class="bn sm" onclick="loadFiles()">&#8635; Refresh</button>
    </div>
    <div class="fscroll">
      <div id="fbody"><div class="empty">Loading...</div></div>
    </div>
  </div>
</div>
<div class="toast" id="toast"></div>
<script>
function toast(m,d=3000){const t=document.getElementById('toast');t.textContent=m;t.classList.add('show');setTimeout(()=>t.classList.remove('show'),d);}
function fmtSz(b){if(b>=1073741824)return(b/1073741824).toFixed(1)+' GB';if(b>=1048576)return(b/1048576).toFixed(1)+' MB';if(b>=1024)return(b/1024).toFixed(1)+' KB';return b+' B';}

async function authLogout(){
  try{await fetch('/api/auth/logout');}catch(e){}
  location.href='/';
}
async function authChangePass(){
  const oldp=prompt('Current password:');
  if(oldp===null)return;
  const newp=prompt('New password (min 4 chars):');
  if(newp===null)return;
  if(newp.length<4){toast('Password too short');return;}
  try{
    const r=await fetch('/api/auth/change?old='+encodeURIComponent(oldp)+'&newp='+encodeURIComponent(newp));
    const j=await r.json();
    if(j&&j.ok){toast('Password updated');}
    else toast((j&&j.error)?j.error:'Password update failed');
  }catch(e){toast('Error: '+e.message);}
}

async function devQuick(c){document.getElementById('devCmdIn').value=c;await devRun();}
async function devRun(){
  const cmd=document.getElementById('devCmdIn').value.trim();
  if(!cmd){toast('Enter a command');return;}
  const out=document.getElementById('devOut');
  try{
    const r=await fetch('/api/console?cmd='+encodeURIComponent(cmd));
    const j=await r.json();
    out.style.display='block';
    out.textContent=(j&&j.out)?j.out:'(no output)';
  }catch(e){out.style.display='block';out.textContent='Error: '+e.message;}
}
async function devLogRefresh(){
  try{
    const j=await fetch('/api/logs').then(r=>r.json());
    document.getElementById('devLogView').textContent=(j&&j.text)?j.text:'';
  }catch(e){}
}
async function devLogToggle(){
  const on=document.getElementById('devLogEn').checked;
  await fetch('/api/logs?enable='+(on?'1':'0'));
  const wrap=document.getElementById('devLogWrap');
  const clr=document.getElementById('devLogClr');
  wrap.style.display=on?'block':'none';
  clr.style.display=on?'inline-block':'none';
  if(on){
    await devLogRefresh();
    if(!window._devLogIv) window._devLogIv=setInterval(devLogRefresh,2000);
  }else{
    if(window._devLogIv){clearInterval(window._devLogIv); window._devLogIv=null;}
  }
}
async function devLogClear(){
  await fetch('/api/logs?clear=1');
  await devLogRefresh();
  toast('Log cleared');
}

let dbgPaused=true;
let dbgTimer=null;
async function dbgRefresh(){
  if(dbgPaused) return;
  try{
    const j=await fetch('/api/logs').then(r=>r.json());
    const out=document.getElementById('dbgOut');
    out.textContent=(j&&j.text)?j.text:'';
    out.scrollTop=out.scrollHeight;
  }catch(e){}
}
async function dbgTogglePause(){
  dbgPaused=!dbgPaused;
  const b=document.getElementById('dbgPauseBtn');
  const s=document.getElementById('dbgState');
  if(dbgPaused){
    b.textContent='Start';
    s.textContent='Off';
    try{ await fetch('/api/logs?enable=0'); }catch(e){}
    if(dbgTimer){clearInterval(dbgTimer);dbgTimer=null;}
  }else{
    b.textContent='Pause';
    s.textContent='Live';
    try{ await fetch('/api/logs?enable=1'); }catch(e){}
    dbgRefresh();
    if(!dbgTimer) dbgTimer=setInterval(dbgRefresh,2500);
  }
}
async function dbgClear(){
  try{
    await fetch('/api/logs?clear=1');
    await dbgRefresh();
    toast('Debug cleared');
  }catch(e){toast('Error: '+e.message);}
}

(function(){
  const el=document.getElementById('ipLbl');
  if(location.protocol!=='http:'){
    el.innerHTML='<span style="color:#f87171;font-weight:700">Use <b>http://</b> not https — this board has no HTTPS.</span><br><span style="font-size:.78rem;color:#94a3b8">Then open: http://'+location.hostname+'/</span>';
  }else{
    el.textContent='http://'+location.hostname+'/ \u00B7 Same dashboard on Ethernet or Wi\u2011Fi IP \u00B7 Live: /mjpeg (VLC) \u00B7 /stream';
  }
})();

