karpus2807/esp32-s3/app_httpd.cpp
function togglePanel(id, onOpen){
  const p=document.getElementById(id);
  const show=p.style.display==='none';
  p.style.display=show?'block':'none';
  if(show && onOpen) onOpen();
}

// ── Status refresh ─────────────────────────────────────────────────────────
async function refreshStatus(){
  try{
    const [stor,wifi,sysinfo]=await Promise.all([
      fetch('/storage').then(r=>r.json()).catch(()=>({})),
      fetch('/wifi').then(r=>r.json()).catch(()=>({})),
      fetch('/sysinfo').then(r=>r.json()).catch(()=>({}))
    ]);

    // Recording
    const rs=stor.recordingStatus||'';
    const rb=document.getElementById('recBadge');
    if(rs.startsWith('REC ')){rb.textContent='\u25cf REC';rb.className='badge g';}
    else if(rs.includes('full')||rs.includes('Cannot')){rb.textContent='\u2717 Error';rb.className='badge r';}
    else{rb.textContent=rs.length>28?rs.slice(0,28)+'\u2026':rs||'Idle';rb.className='badge y';}
    const rf=(stor.recordingFile||'').replace('/captures/','');
    document.getElementById('recFile').textContent=rf||'-';

    // SD
    const sb=document.getElementById('sdBadge');
    if(stor.sdReady){sb.textContent='Mounted';sb.className='badge g';}else{sb.textContent='Not mounted';sb.className='badge r';}
    document.getElementById('sdSpace').textContent=stor.sdReady?(stor.freeMB+' / '+stor.totalMB+' MB'):'-';

    // WiFi badge (also shows Ethernet-only: LAN config works without Wi\u2011Fi)
    const ws=wifi.status||'';
    const wb=document.getElementById('wifiBadge');
    const ethOk=wifi.ethIp && wifi.ethIp.length>0 && wifi.ethIp!=='0.0.0.0';
    if(ws.startsWith('Connected')){wb.textContent='\u2714 '+(wifi.wifiIp||wifi.ip);wb.className='badge g';}
    else if(ethOk){wb.textContent='\u2714 ETH '+wifi.ethIp;wb.className='badge g';}
    else if(ws.includes('Retry')||ws.includes('retry')||ws.includes('Connecting')){wb.textContent='\u23F3 '+ws.slice(0,20);wb.className='badge y';}
    else if(ws.includes('failed')||ws.includes('Disconnected')||ws.includes('Failed')){wb.textContent='\u2717 No Wi\u2011Fi';wb.className='badge r';}
    else{wb.textContent=ws.length>22?ws.slice(0,22)+'\u2026':ws||'-';wb.className='badge y';}
    document.getElementById('wifiStatusRow').textContent=ws;

    // WiFi ON/OFF button state
    const wBtn=document.getElementById('wifiOnOffBtn');
    if(wBtn){
      const acOff=ws.includes('auto-connect OFF');
      wBtn.textContent=acOff?'WiFi ON':'WiFi OFF';
      wBtn.className=acOff?'bn sm':'bd sm';
    }

    // Network URLs (HTTP only) — same UI on LAN or Wi\u2011Fi
    let netHtml='';
    if(location.protocol!=='http:'){
      netHtml='<span style="color:#f87171;font-weight:700">Open <b>http://</b>'+location.host+'/ (not https)</span><br>';
    }
    netHtml+='<span style="font-size:.78rem">This browser: <span class="mono">http://'+location.hostname+'/</span></span>';
    if(wifi.ethIp && wifi.ethIp.length>0 && wifi.ethIp!=='0.0.0.0'){
      netHtml+='<br><span style="font-size:.78rem">Ethernet: <a class="mono" style="color:#38bdf8" href="http://'+wifi.ethIp+'/">http://'+wifi.ethIp+'/</a> (ethLink='+(wifi.ethLink?'yes':'no')+')</span>';
    }
    if(wifi.wifiIp && wifi.wifiIp.length>0 && wifi.wifiIp!=='0.0.0.0'){
      netHtml+='<br><span style="font-size:.78rem">Wi\u2011Fi STA: <a class="mono" style="color:#38bdf8" href="http://'+wifi.wifiIp+'/">http://'+wifi.wifiIp+'/</a></span>';
    }
    if(location.protocol==='http:'){
      netHtml+='<br><span style="font-size:.72rem;color:#64748b">Live: /mjpeg or /stream (VLC) \u00B7 Primary IP (API): '+((wifi.ip&&wifi.ip!=='0.0.0.0')?wifi.ip:'-')+'</span>';
    }
    document.getElementById('ipLbl').innerHTML=netHtml;

    const dc=document.getElementById('deviceClock');
    if(dc && sysinfo.deviceTime!==undefined){
      dc.textContent=sysinfo.deviceTime;
      dc.style.color=sysinfo.timeOk?'#7dd3fc':'#f87171';
    }

    // Time sync badge
    const tb=document.getElementById('timeBadge');
    const dt=document.getElementById('deviceTime');
    if(tb){
      if(sysinfo.timeSynced){
        tb.textContent='\u2714 Synced';tb.className='badge g';
      }else{
        tb.textContent='\u2717 Not synced';tb.className='badge r';
      }
    }
    if(dt && sysinfo.deviceTime!==undefined){
      dt.textContent=sysinfo.deviceTime;
    }

    // CPU
    if(sysinfo.cpu0!==undefined){
      const c0=Math.min(sysinfo.cpu0,100), c1=Math.min(sysinfo.cpu1,100);
      document.getElementById('cpu0Pct').textContent=c0+'%';
      document.getElementById('cpu1Pct').textContent=c1+'%';
      document.getElementById('cpu0Bar').style.width=c0+'%';
      document.getElementById('cpu1Bar').style.width=c1+'%';
    }
    // RAM
    if(sysinfo.heapFree!==undefined){
      const hf=sysinfo.heapFree, ht=sysinfo.heapTotal, hm=sysinfo.heapMin;
      document.getElementById('ramFree').textContent=fmtSz(hf);
      document.getElementById('ramTotal').textContent=fmtSz(ht);
      document.getElementById('ramMin').textContent=fmtSz(hm);
      const pct=ht>0?Math.round((1-hf/ht)*100):0;
      document.getElementById('ramBar').style.width=pct+'%';
    }
    // PSRAM
    if(sysinfo.psramFree!==undefined){
      const pf=sysinfo.psramFree, pt=sysinfo.psramTotal;
      document.getElementById('psramFree').textContent=fmtSz(pf);
      document.getElementById('psramTotal').textContent=fmtSz(pt);
      const pct=pt>0?Math.round((1-pf/pt)*100):0;
      document.getElementById('psramBar').style.width=pct+'%';
    }
  }catch(e){console.error(e);}
}

// ── WiFi config panel ──────────────────────────────────────────────────────
let wEnterprise=false;
function wModeChange(v){
  wEnterprise=v===1;
  document.getElementById('wPassRow').style.display=wEnterprise?'none':'block';
  document.getElementById('wIdentRow').style.display=wEnterprise?'block':'none';
  document.getElementById('wEapPassRow').style.display=wEnterprise?'block':'none';
}
function renderWifiProfiles(w){
  const el=document.getElementById('wifiProfList');
  if(!el) return;
  const profs=Array.isArray(w.profiles)?w.profiles:[];
  if(profs.length===0){
    el.innerHTML='<span style="color:#64748b">No profile data</span>';
    return;
  }
  let h='';
  for(const p of profs){
    const ssid=(p.ssid!=null&&String(p.ssid).length)?String(p.ssid):'(empty)';
    const pref=p.pref?'<span style="color:#4ade80;margin-left:6px">preferred</span>':'';
    const kind=p.enterprise?'EAP':'WPA';
    const hasSsid=(p.ssid!=null&&String(p.ssid).length);
    const delBtn=hasSsid
      ? '<button type="button" class="bd sm" onclick="deleteWifiSlot('+p.slot+')">Delete</button>'
      : '';
    const swBtn=hasSsid
      ? '<button type="button" class="bp sm" onclick="switchWifiSlot('+p.slot+')">Switch</button>'
      : '';
    h+='<div style="display:flex;justify-content:space-between;align-items:center;gap:8px;padding:6px 0;border-bottom:1px solid #1e293b">'+
      '<span><b>#'+(p.slot+1)+'</b> <span class="mono">'+ssid.replace(/&/g,'&amp;').replace(/</g,'&lt;')+'</span>'+pref+
      ' <span style="color:#64748b">'+kind+'</span></span>'+
      '<span style="display:flex;gap:6px">'+swBtn+delBtn+'</span></div>';
  }
  el.innerHTML=h;
}
async function switchWifiSlot(slot){
  try{
    const w=await fetch('/wifi?useslot='+encodeURIComponent(slot)+'&reconnect=1').then(r=>r.json());
    const m=w.msg||('Switching to saved profile slot '+(slot+1));
    document.getElementById('wifiMsg').textContent=m;
    toast(m);
    await loadWifiConfig();
  }catch(e){ toast('Error: '+e.message); }
}
async function deleteWifiSlot(slot){
  if(!confirm('Delete saved Wi\u2011Fi profile slot '+(slot+1)+'?')) return;
  try{
    await fetch('/wifi?delslot='+encodeURIComponent(slot)).then(r=>r.json());
    toast('Profile deleted');
    await loadWifiConfig();
    refreshStatus();
  }catch(e){ toast('Error: '+e.message); }
}
async function loadWifiConfig(){
  try{
    const w=await fetch('/wifi').then(r=>r.json());
    document.getElementById('wSsid').value=w.ssid||'';
    document.getElementById('wIdent').value=w.identity||'';
    document.getElementById('wPass').value='';
    document.getElementById('wEapPass').value='';
    wEnterprise=w.enterprise||false;
    const radios=document.getElementsByName('wMode');
    radios[0].checked=!wEnterprise; radios[1].checked=wEnterprise;
    wModeChange(wEnterprise?1:0);
    const ps=(typeof w.prefSlot==='number')?w.prefSlot:parseInt(w.prefSlot,10)||0;
    document.getElementById('wSlot').value=String(Math.max(0,Math.min(2,ps)));
    renderWifiProfiles(w);
    let hint='';
    if(wEnterprise) hint=(w.eapPassSet?'EAP password saved':'No EAP password');
    else hint=(w.passSet?'Password saved':'No password saved');
    document.getElementById('wifiMsg').textContent=hint;
  }catch(e){}
}
async function saveWifi(reconnect){
  const ssid=document.getElementById('wSsid').value.trim();
  if(!ssid){document.getElementById('wifiMsg').textContent='SSID is required';return;}
  let url='/wifi?ssid='+encodeURIComponent(ssid)+'&ent='+(wEnterprise?1:0);
  if(wEnterprise){
    const id=document.getElementById('wIdent').value.trim();
    const ep=document.getElementById('wEapPass').value;
    url+='&id='+encodeURIComponent(id);
    if(ep) url+='&ep='+encodeURIComponent(ep);
  } else {
    const p=document.getElementById('wPass').value;
    if(p) url+='&pass='+encodeURIComponent(p);
  }
  const slotEl=document.getElementById('wSlot');
  if(slotEl) url+='&slot='+encodeURIComponent(slotEl.value);
  if(reconnect) url+='&reconnect=1';
  try{
    const w=await fetch(url).then(r=>r.json());
    renderWifiProfiles(w);
    if(reconnect){
      document.getElementById('wifiMsg').textContent='Reconnecting (saved profiles / failover). Watch status badge; if IP changes, open the new URL.';
      toast('Reconnecting… if IP changes, use the new http:// address',8000);
    } else {
      document.getElementById('wifiMsg').textContent='Saved. '+w.status;
      toast('WiFi config saved');
    }
  }catch(e){document.getElementById('wifiMsg').textContent='Error: '+e.message;}
}

async function scanWifi(){
  const btn=document.getElementById('scanBtn');
  const row=document.getElementById('scanResultsRow');
  const res=document.getElementById('scanResults');
  btn.disabled=true; btn.textContent='Scanning...';
  res.innerHTML='<div style="padding:8px;color:#64748b">Scanning... please wait ~5s</div>';
  row.style.display='block';
  try{
    const data=await fetch('/wifiscan').then(r=>r.json());
    const nets=Array.isArray(data)?data:(data.nets||[]);
    if(data && data.diag){
      const d=data.diag;
      const st='scanCode='+(d.scanCode!==undefined?d.scanCode:'-')+
        ' wl='+(d.wlText||d.wl||'-')+
        ' mode='+(d.mode!==undefined?d.mode:'-')+
        ' rssi='+(d.rssi!==undefined?d.rssi:'-');
      document.getElementById('wifiMsg').textContent='Scan diag: '+st;
    }
    if(!nets||nets.length===0){
      res.innerHTML='<div style="padding:8px;color:#64748b">No networks found. Check antenna.</div>';
    } else {
      let h='';
      for(const n of nets){
        const bars=n.rssi>=-55?'▪▪▪▪':n.rssi>=-70?'▪▪▪○':n.rssi>=-80?'▪▪○○':'▪○○○';
        const ent=n.auth.includes('ENT');
        const safeSsid=n.ssid.replace(/&/g,'&amp;').replace(/</g,'&lt;').replace(/>/g,'&gt;').replace(/"/g,'&quot;');
        h+=`<div style="padding:7px 10px;border-bottom:1px solid #1e293b;cursor:pointer;display:flex;justify-content:space-between;align-items:center"
              onmouseover="this.style.background='#1e293b'" onmouseout="this.style.background=''"
              data-ssid="${safeSsid}" data-ent="${ent?1:0}" onclick="selectSsidFromEl(this)">
            <span>${safeSsid}</span>
            <span style="color:#64748b;white-space:nowrap;margin-left:8px">${bars} ${n.rssi}dBm &nbsp;<span style="color:#93c5fd">${n.auth}</span></span>
          </div>`;
      }
      res.innerHTML=h;
    }
  }catch(e){res.innerHTML='<div style="padding:8px;color:#ef4444">Scan error: '+e.message+'</div>';}
  btn.disabled=false; btn.textContent='\uD83D\uDCE1 Scan';
}

