karpus2807/esp32-s3/app_httpd.cpp
function selectSsidFromEl(el){selectSsid(el.dataset.ssid,parseInt(el.dataset.ent)||0);}
function selectSsidFromEl(el){selectSsid(el.dataset.ssid,parseInt(el.dataset.ent)||0);}
function selectSsid(ssid, isEnt){
  document.getElementById('wSsid').value=ssid;
  document.getElementById('scanResultsRow').style.display='none';
  if(isEnt){ const r=document.getElementsByName('wMode'); r[1].checked=true; wModeChange(1); }
  else      { const r=document.getElementsByName('wMode'); r[0].checked=true; wModeChange(0); }
  toast('Selected: '+ssid);
}

async function clearWifiCfg(){
  if(!confirm('Clear saved WiFi config?')) return;
  try{
    await fetch('/wifi?clear=1');
    document.getElementById('wSsid').value='';
    document.getElementById('wPass').value='';
    document.getElementById('wIdent').value='';
    document.getElementById('wEapPass').value='';
    document.getElementById('wifiMsg').textContent='WiFi config cleared.';
    toast('WiFi config cleared');
    await loadWifiConfig();
  }catch(e){document.getElementById('wifiMsg').textContent='Error: '+e.message;}
}

async function toggleWifiRadio(){
  const btn=document.getElementById('wifiOnOffBtn');
  const isOn=btn.textContent.includes('OFF');
  const cmd=isOn?'autowifi off':'autowifi on';
  try{
    const r=await fetch('/api/console?cmd='+encodeURIComponent(cmd));
    const j=await r.json();
    toast(j.out||cmd);
    btn.textContent=isOn?'WiFi ON':'WiFi OFF';
    btn.className=isOn?'bn sm':'bd sm';
    refreshStatus();
  }catch(e){ toast('Error: '+e.message); }
}

async function rebootDevice(){
  if(!confirm('Reboot device?')) return;
  try{
    await fetch('/reboot');
    toast('Rebooting... reopen page in ~15s',10000);
    document.getElementById('msg').textContent='Rebooting — please wait ~15s then reopen dashboard.';
  }catch(e){ toast('Reboot sent (connection lost is normal)'); }
}

// ── File list ──────────────────────────────────────────────────────────────
async function loadFiles(){
  const b=document.getElementById('fbody');
  try{
    const files=await fetch('/files').then(r=>r.json());
    if(!files||files.length===0){b.innerHTML='<div class="empty">No recordings yet</div>';return;}
    let h='<table class="ftbl"><thead><tr><th>Filename</th><th>Size</th><th>Actions</th></tr></thead><tbody>';
    for(const f of files){
      const n=encodeURIComponent(f.name);
      const safen=f.name.replace(/'/g,"\\'").replace(/"/g,'&quot;');
      h+=`<tr data-name="${f.name.replace(/"/g,'&quot;')}">
        <td class="mono">${f.name}</td>
        <td>${fmtSz(f.size)}</td>
        <td class="acts">
          <a href="/download?f=${n}" download="${f.name}"><button class="bp sm" title="Download">&#8595; Download</button></a>
          <button class="bd sm" title="Delete" onclick="delFile('${safen}',this.closest('tr'))">&#10007; Delete</button>
        </td>
      </tr>`;
    }
    h+='</tbody></table>';
    b.innerHTML=h;
  }catch(e){b.innerHTML='<div class="empty">Error loading files</div>';}
}

async function delFile(name,row){
  if(!confirm('Delete '+name+'?'))return;
  try{
    const d=await fetch('/delete?f='+encodeURIComponent(name)).then(r=>r.json());
    if(d.ok){row.remove();toast('Deleted: '+name);}
    else toast('Delete failed: '+(d.error||'unknown'));
  }catch(e){toast('Error: '+e.message);}
}

// ── Snapshot / SD ──────────────────────────────────────────────────────────
async function saveSnap(){
  document.getElementById('msg').textContent='Saving snapshot...';
  try{
    const d=await fetch('/save').then(r=>r.json());
    document.getElementById('msg').textContent=d.ok?'Saved: '+(d.path||''):'Snapshot failed';
    if(d.ok)loadFiles();
  }catch(e){document.getElementById('msg').textContent='Error: '+e.message;}
}
async function sdAct(a){
  document.getElementById('msg').textContent='Running '+a+'...';
  try{
    const d=await fetch('/storage?action='+a).then(r=>r.json());
    document.getElementById('msg').textContent=d.message||'Done';
    refreshStatus();if(a==='wipe')loadFiles();
  }catch(e){document.getElementById('msg').textContent='Error: '+e.message;}
}

// ── Live preview (native MJPEG + /sysinfo streamFps) ──
let prevActive=false,prevFpsTimer=null;
async function updatePrevStreamFps(){
  if(!prevActive)return;
  try{
    const s=await fetch('/sysinfo').then(r=>r.json());
    if(s.streamFps!==undefined){
      const v=Number(s.streamFps);
      const el=document.getElementById('prevFps');
      if(v>0.05)el.textContent=v.toFixed(1)+' fps';
      else el.textContent='live\u2026';
    }
  }catch(e){}
}
function togglePreview(){
  prevActive=!prevActive;
  document.getElementById('prevToggle').textContent=prevActive?'\u23F8 Stop':'\u25B6 Start';
  const img=document.getElementById('prevImg');
  const off=document.getElementById('prevOff');
  const fps=document.getElementById('prevFps');
  if(prevActive){
    img.onerror=function(){
      fps.textContent='no video \u2014 open /stream in new tab or check Serial log';
    };
    img.onload=function(){fps.textContent='live\u2026';};
    img.src=window.location.origin+'/mjpeg?'+Date.now();
    img.style.display='block';
    off.style.display='none';
    fps.textContent='\u2026';
    updatePrevStreamFps();
    prevFpsTimer=setInterval(updatePrevStreamFps,1500);
  }else{
    if(prevFpsTimer){clearInterval(prevFpsTimer);prevFpsTimer=null;}
    img.onerror=null;
    img.onload=null;
    img.src='';
    img.style.display='none';
    off.style.display='';
    fps.textContent='';
  }
}

// ── IoT / Sensors ──────────────────────────────────────────────────────────
async function loadIotConfig(){
  try{
    const j=await fetch('/api/iot').then(r=>r.json());
    if(j.server!==undefined) document.getElementById('iotSrv').value=j.server;
    if(j.port!==undefined) document.getElementById('iotPort').value=j.port;
    if(j.token!==undefined) document.getElementById('iotTok').value=j.token;
    if(j.deviceId!==undefined) document.getElementById('iotDev').value=j.deviceId;
    if(j.interval!==undefined) document.getElementById('iotIntv').value=j.interval;
    if(j.warnTemp!==undefined) document.getElementById('iotWarnT').value=j.warnTemp;
    if(j.criticalTemp!==undefined) document.getElementById('iotCritT').value=j.criticalTemp;
    if(j.alertTemp!==undefined) document.getElementById('iotAlrtT').value=j.alertTemp;
  }catch(e){}
}
async function saveIotConfig(){
  const params=new URLSearchParams();
  params.set('server',document.getElementById('iotSrv').value);
  params.set('port',document.getElementById('iotPort').value);
  params.set('token',document.getElementById('iotTok').value);
  params.set('deviceId',document.getElementById('iotDev').value);
  params.set('interval',document.getElementById('iotIntv').value);
  params.set('warnTemp',document.getElementById('iotWarnT').value);
  params.set('criticalTemp',document.getElementById('iotCritT').value);
  params.set('alertTemp',document.getElementById('iotAlrtT').value);
  try{
    const r=await fetch('/api/iot/save?'+params.toString());
    const j=await r.json();
    document.getElementById('iotMsg').textContent=(j&&j.ok)?'Saved':'Error';
    toast(j&&j.ok?'IoT config saved':'Save failed');
  }catch(e){document.getElementById('iotMsg').textContent='Error: '+e.message;}
}
async function refreshIot(){
  try{
    const j=await fetch('/api/iot').then(r=>r.json());
    const te=document.getElementById('iotTemp');
    const he=document.getElementById('iotHum');
    if(j.temp!==null&&j.temp!==undefined){te.textContent=j.temp.toFixed(1)+' \u00b0C';}else{te.textContent='--';}
    if(j.hum!==null&&j.hum!==undefined){he.textContent=j.hum.toFixed(0)+' %';}else{he.textContent='--';}
    const ds=document.getElementById('iotDhtSt');
    ds.textContent=j.dhtStatus||'--';ds.className='badge '+(j.dhtOk?'g':'r');
    const pe=document.getElementById('iotPir');
    pe.textContent=j.pirAlert?'MOTION':'No motion';pe.className='badge '+(j.pirAlert?'r':'g');
    const al=document.getElementById('iotAlert');
    const alv=j.alertLevel||1;
    al.textContent=alv>=3?'CRITICAL':alv>=2?'WARNING':'NORMAL';
    al.className='badge '+(alv>=3?'r':alv>=2?'y':'g');
    const mq=document.getElementById('iotMqtt');
    mq.textContent=j.mqttConnected?'Connected':'Disconnected';mq.className='badge '+(j.mqttConnected?'g':'r');
    const pa=document.getElementById('iotPirAge');
    if(j.pirAgeS>0){pa.textContent=j.pirAgeS+'s ago';}else{pa.textContent='never';}
  }catch(e){}
}

// ── Boot ───────────────────────────────────────────────────────────────────
refreshStatus();
loadFiles();
refreshIot();
window._statusIv=setInterval(refreshStatus,4000);
window._filesIv=setInterval(loadFiles,30000);
window._iotIv=setInterval(refreshIot,5000);
// Pause polling when tab is hidden to save bandwidth + device CPU
document.addEventListener('visibilitychange',function(){
  if(document.hidden){
    clearInterval(window._statusIv);clearInterval(window._filesIv);clearInterval(window._iotIv);
    if(dbgTimer){clearInterval(dbgTimer);dbgTimer=null;}
    if(window._devLogIv){clearInterval(window._devLogIv);window._devLogIv=null;}
    if(prevActive){togglePreview();}
  }else{
    refreshStatus();loadFiles();refreshIot();
    window._statusIv=setInterval(refreshStatus,4000);
    window._filesIv=setInterval(loadFiles,30000);
    window._iotIv=setInterval(refreshIot,5000);
    if(!dbgPaused && !dbgTimer) dbgTimer=setInterval(dbgRefresh,2500);
  }
});
</script>
</body>
</html>
)rawliteral";
  return httpd_resp_sendstr(req, html);
}

// Security: reject filenames that could escape /captures/
static bool isValidFilename(const char *name) {
  if (!name || name[0] == '\0' || name[0] == '.') return false;
  size_t len = strlen(name);
  if (len > 60) return false;
  for (size_t i = 0; i < len; i++) {
    char c = name[i];
    if (c == '/' || c == '\\' || c == ':') return false;
    if (!isalnum((unsigned char)c) && c != '_' && c != '-' && c != '.') return false;
  }
  return true;
}

