karpus2807/esp32-s3/app_httpd.cpp
static esp_err_t files_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  String json = listCapturesJson(50);
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json.c_str(), json.length());
}

static esp_err_t download_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  char *buf = NULL;
  char fname[64] = {0};
  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;
  httpd_query_key_value(buf, "f", fname, sizeof(fname) - 1);
  free(buf);

  if (!isValidFilename(fname)) {
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid filename");
    return ESP_FAIL;
  }
  if (!g_sdReady) {
    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SD not ready");
    return ESP_FAIL;
  }

  String path = String("/captures/") + fname;
  File file = SD_MMC.open(path, FILE_READ);
  if (!file) {
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  size_t fileSize = file.size();

  // TCP socket tuning — larger send buffer, Nagle ON (don't set TCP_NODELAY:
  // chunked encoding does 3 separate send() calls per chunk; NODELAY turns each
  // into a tiny packet and causes ACK-ping-pong, making throughput 10x worse)
  int sockfd = httpd_req_to_sockfd(req);
  if (sockfd >= 0) {
    // NOTE: SO_SNDBUF is stored as u16_t in lwIP (max 65535).
    // Setting 65536 would wrap to 0 and kill all sends!
    // lwIP caps at CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744 unless we match that cap.
    // Set to 32768 which fits u16_t and is above the cap — lwIP will use the cap.
    int sndbuf = 65535;
    (void)setsockopt(sockfd, SOL_SOCKET, SO_SNDBUF, &sndbuf, sizeof(sndbuf));
  }

  // Content headers
  const char *ct = "application/octet-stream";
  size_t fnLen = strlen(fname);
  if (fnLen > 4 && strcasecmp(fname + fnLen - 4, ".jpg") == 0) ct = "image/jpeg";
  else if (fnLen > 4 && strcasecmp(fname + fnLen - 4, ".avi") == 0) ct = "video/x-msvideo";
  httpd_resp_set_type(req, ct);
  String disp = String("attachment; filename=\"") + fname + "\"";
  httpd_resp_set_hdr(req, "Content-Disposition", disp.c_str());
  char cl[20]; snprintf(cl, sizeof(cl), "%u", (unsigned)fileSize);
  httpd_resp_set_hdr(req, "Content-Length", cl);
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  // 256 KB PSRAM read buffer — fewer SD mutex acquisitions per download,
  // recording task gets SD back between each 256KB read cycle
  const size_t kChunk = 256 * 1024;
  size_t readCap = kChunk;
  uint8_t *chunk = (uint8_t *)heap_caps_malloc(kChunk, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (!chunk) {
    readCap = 32768;
    chunk = (uint8_t *)heap_caps_malloc(readCap, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  }
  if (!chunk) { file.close(); return httpd_resp_send_500(req); }

  // Diagnostic counters
  uint32_t tReadMs = 0, tSendMs = 0, nChunks = 0;
  uint32_t tTotal = millis();

  size_t n;
  esp_err_t res = ESP_OK;
  while (true) {
    uint32_t tR0 = millis();
    n = file.read(chunk, readCap);
    tReadMs += millis() - tR0;
    if (n == 0) break;
    uint32_t tS0 = millis();
    if (httpd_resp_send_chunk(req, (const char *)chunk, n) != ESP_OK) {
      res = ESP_FAIL; break;
    }
    tSendMs += millis() - tS0;
    nChunks++;
  }
  heap_caps_free(chunk);
  file.close();

  uint32_t elapsed = millis() - tTotal;
  float speedKBs = elapsed ? (fileSize / 1024.0f) / (elapsed / 1000.0f) : 0;
  log_i("[DL] %s  %u bytes  %.0f KB/s  | SD: %u ms  WiFi: %u ms  chunks: %u",
        fname, (unsigned)fileSize, speedKBs, tReadMs, tSendMs, nChunks);

  if (res == ESP_OK) httpd_resp_send_chunk(req, NULL, 0);
  return res;
}

static esp_err_t delete_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  char *buf = NULL;
  char fname[64] = {0};
  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;
  httpd_query_key_value(buf, "f", fname, sizeof(fname) - 1);
  free(buf);

  if (!isValidFilename(fname)) {
    const char *err = "{\"ok\":false,\"error\":\"invalid filename\"}";
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, err, strlen(err));
  }

  String path = String("/captures/") + fname;
  bool ok = g_sdReady && SD_MMC.remove(path);
  String resp = ok ? "{\"ok\":true}" : "{\"ok\":false,\"error\":\"remove failed\"}";
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, resp.c_str(), resp.length());
}

// GET /wifiscan  → scan networks async (non-blocking), return JSON array
// Uses WIFI_SCAN_RUNNING / WIFI_SCAN_DONE pattern to avoid blocking httpd task
static esp_err_t wifiscan_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;

  g_wifiScanRequested = true;
  const uint32_t t0 = millis();
  ui_debug_logf("[WiFiScan] start wl=%d (%s) mode=%d",
                (int)WiFi.status(), cctv_wifi_status_str(WiFi.status()),
                (int)WiFi.getMode());

  if (!cctv_wifi_try_lock(12000)) {
    g_wifiScanRequested = false;
    ui_debug_logf("[WiFiScan] lock timeout %lu ms", (unsigned long)(millis() - t0));
    const char *fail = "{\"nets\":[],\"diag\":{\"ok\":false,\"reason\":\"wifi lock timeout\"}}";
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, fail, strlen(fail));
  }

  // Safe cleanup: disconnect(false,true) = radio ON rakhte hue stored SSID erase karo.
  // disconnect(true) GALAT hai — woh radio OFF kar deta hai!
  WiFi.scanDelete();
  WiFi.disconnect(false, true);
  vTaskDelay(pdMS_TO_TICKS(150));
  (void)esp_wifi_sta_enterprise_disable();

  if (WiFi.getMode() != WIFI_STA) {
    WiFi.mode(WIFI_STA);
    vTaskDelay(pdMS_TO_TICKS(200));
  }
  esp_wifi_set_ps(WIFI_PS_NONE);
  vTaskDelay(pdMS_TO_TICKS(100));

  ui_debug_logf("[WiFiScan] ready wl=%d (%s) mode=%d heap=%u",
                (int)WiFi.status(), cctv_wifi_status_str(WiFi.status()),
                (int)WiFi.getMode(), (unsigned)ESP.getFreeHeap());

  uint16_t apCount = 0;
  esp_err_t scanErr = ESP_OK;
  uint8_t triesUsed = 0;

  // Async scan — start karo, poll karo, timeout se safe hai
  for (uint8_t t = 0; t < 2; ++t) {
    triesUsed = (uint8_t)(t + 1);
    WiFi.scanDelete();

