karpus2807/esp32-s3/app_httpd.cpp
    WiFi.scanNetworks(true, true);  // async=true, show_hidden=true
    ui_debug_logf("[WiFiScan] try=%u async started", (unsigned)triesUsed);

    const uint32_t deadline = millis() + 8000;
    int16_t result = WIFI_SCAN_RUNNING;
    while (millis() < deadline) {
      vTaskDelay(pdMS_TO_TICKS(150));
      result = WiFi.scanComplete();
      if (result >= 0 || result == WIFI_SCAN_FAILED) break;
    }
    ui_debug_logf("[WiFiScan] try=%u result=%d wl=%d elapsed=%lu",
                  (unsigned)triesUsed, (int)result, (int)WiFi.status(),
                  (unsigned long)(millis() - t0));
    if (result > 0) {
      apCount = (uint16_t)result;
      scanErr = ESP_OK;
      break;
    }
    scanErr = (result == WIFI_SCAN_FAILED) ? ESP_FAIL : ESP_OK;
    WiFi.scanDelete();
    vTaskDelay(pdMS_TO_TICKS(500));
  }

  int n = (int)apCount;
  cctv_wifi_unlock();
  g_wifiScanRequested = false;

  // Reset background retry so it can try profiles again after user scans
  extern volatile bool g_wifiRetryExhausted;
  g_wifiRetryExhausted = false;

  Serial.printf("[WiFiScan] done nets=%d tries=%u %lums err=%s\n",
                n, (unsigned)triesUsed, (unsigned long)(millis() - t0),
                esp_err_to_name(scanErr));

  String resp;
  resp.reserve(128 + n * 80);
  resp = "{\"nets\":[";
  for (int i = 0; i < n; i++) {
    if (i > 0) resp += ',';
    wifi_auth_mode_t auth = WiFi.encryptionType(i);
    const char *authStr = "OPEN";
    if      (auth == WIFI_AUTH_WPA2_ENTERPRISE) authStr = "WPA2-ENT";
    else if (auth == WIFI_AUTH_WPA3_ENTERPRISE) authStr = "WPA3-ENT";
    else if (auth == WIFI_AUTH_WPA3_PSK)        authStr = "WPA3";
    else if (auth == WIFI_AUTH_WPA2_PSK)        authStr = "WPA2";
    else if (auth == WIFI_AUTH_WPA_WPA2_PSK)    authStr = "WPA/WPA2";
    else if (auth == WIFI_AUTH_WPA_PSK)         authStr = "WPA";
    else if (auth != WIFI_AUTH_OPEN)            authStr = "OTHER";
    String ssid = WiFi.SSID(i);
    ssid.replace("\\", "\\\\"); ssid.replace("\"", "\\\"");
    resp += "{\"ssid\":\"" + ssid + "\",\"rssi\":" + String(WiFi.RSSI(i)) +
            ",\"auth\":\"" + authStr + "\",\"ch\":" + String(WiFi.channel(i)) + "}";
  }
  WiFi.scanDelete();

  resp += "],\"diag\":{\"ok\":true,\"tries\":";
  resp += String((unsigned)triesUsed);
  resp += ",\"err\":\"";
  resp += esp_err_to_name(scanErr);
  resp += "\",\"apCount\":";
  resp += String((unsigned)apCount);
  resp += ",\"ms\":";
  resp += String((unsigned long)(millis() - t0));
  resp += ",\"wl\":";
  resp += String((int)WiFi.status());
  resp += ",\"connected\":";
  resp += (WiFi.status() == WL_CONNECTED) ? "true" : "false";
  resp += "}}";

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, resp.c_str(), resp.length());
}

// GET /sysinfo → heap, PSRAM, CPU usage (idle task watermarks as proxy)
static esp_err_t sysinfo_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  // Heap
  size_t heapFree  = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
  size_t heapTotal = heap_caps_get_total_size(MALLOC_CAP_INTERNAL);
  size_t heapMin   = heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL);
  // PSRAM: prefer heap_caps + cctv_psram_* (Arduino getPsram* can be 0 on IDF 5.x).
  const size_t psramFree  = cctv_psram_free_bytes();
  const size_t psramTotal = cctv_psram_total_bytes();
  // CPU load via FreeRTOS runtime stats (stack watermarks of idle tasks as proxy)
  // Use configRUN_TIME_COUNTER_TYPE approach is ESP-IDF specific.
  // Simple approach: read last idle tick counts delta. Use esp_cpu_cycle_count or
  // just approximate via idle task stack high-watermarks as a rough indicator.
  // More reliable: use esp_get_idf_version, but for CPU% we use the following trick:
  // measure how many times idle loop runs per status period — instead we report uptime.
  uint32_t upSec = millis() / 1000;

  String resp = "{";
  resp += "\"heapFree\":"  + String(heapFree)  + ",";
  resp += "\"heapTotal\":" + String(heapTotal) + ",";
  resp += "\"heapMin\":"   + String(heapMin)   + ",";
  resp += "\"psramFree\":" + String(psramFree) + ",";
  resp += "\"psramTotal\":"+ String(psramTotal)+ ",";
  // CPU% approximation: check idle task stack usage
  // FreeRTOS idle tasks are named "IDLE0" and "IDLE1"
  // We read their high watermarks as an inverse proxy for load
  // (low watermark = task used heavily = high load)
  // Use a simple heuristic: report 0 unless we get real data
  UBaseType_t idle0Wm = 0, idle1Wm = 0;
  TaskHandle_t idle0 = xTaskGetIdleTaskHandleForCore(0);
  TaskHandle_t idle1 = xTaskGetIdleTaskHandleForCore(1);
  if (idle0) idle0Wm = uxTaskGetStackHighWaterMark(idle0);
  if (idle1) idle1Wm = uxTaskGetStackHighWaterMark(idle1);
  // idle stack is typically 768 words; lower watermark → less idle time → higher load
  // normalize: assume initial watermark ~700, current watermark → linear inverse
  uint32_t idleStack = 700;
  uint8_t cpu0 = (idle0Wm < idleStack) ? (uint8_t)((idleStack - idle0Wm) * 100 / idleStack) : 0;
  uint8_t cpu1 = (idle1Wm < idleStack) ? (uint8_t)((idleStack - idle1Wm) * 100 / idleStack) : 0;
  resp += "\"cpu0\":" + String(cpu0) + ",";
  resp += "\"cpu1\":" + String(cpu1) + ",";
  resp += "\"uptimeSec\":" + String(upSec) + ",";
  {
    char fpsBuf[16];
    snprintf(fpsBuf, sizeof(fpsBuf), "%.2f", stream_fps_get());
    resp += "\"streamFps\":" + String(fpsBuf) + ",";
  }
  resp += "\"deviceTime\":\"";
  struct tm ti;
  bool t_ok = false;
  if (getLocalTime(&ti, 50)) {
    char tbuf[40];
    strftime(tbuf, sizeof(tbuf), "%d-%m-%Y  %H:%M:%S", &ti);
    resp += String(tbuf);
    t_ok = (ti.tm_year + 1900 >= 2020);
  } else {
    resp += "--/--/---- --:--:--";
  }
  resp += "\",\"timeOk\":";
  resp += t_ok ? "true" : "false";
  resp += ",\"timeSynced\":";
  resp += cctv_wall_clock_sane() ? "true" : "false";
  resp += "}";

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, resp.c_str(), resp.length());
}

// GET /reboot  → immediate reboot (no WiFi check)
static esp_err_t reboot_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_sendstr(req, "{\"ok\":true,\"msg\":\"Rebooting...\"}");
  xTaskCreate([](void*){
    vTaskDelay(800 / portTICK_PERIOD_MS);
    esp_restart();
    vTaskDelete(NULL);
  }, "RebootTask", 4096, NULL, 2, NULL);
  return ESP_OK;
}

// GET /wifi                              → return config (pass masked) + profiles[]
// GET /wifi?ssid=..&pass=..&ent=0      → save normal WiFi (optional &slot=0..2)
// GET /wifi?ssid=..&ent=1&id=..&ep=..  → save enterprise WiFi
// GET /wifi?reconnect=1                → reconnect / failover (no reboot)
// GET /wifi?clear=1                    → clear all saved WiFi profiles
// GET /wifi?delslot=0..2               → delete one profile slot
static esp_err_t wifi_handler(httpd_req_t *req) {
  if (!cctv_auth_require(req)) return ESP_FAIL;
  char *buf = NULL;
  String opMsg;
  if (httpd_req_get_url_query_len(req) > 0 && parse_get(req, &buf) == ESP_OK) {
    char tsmall[24] = {0};
    char qssid[160] = {0};
    char qpass[384] = {0};
    char qid[320] = {0};
    char qep[384] = {0};
    bool doReconnect = false;
    bool only_delslot = false;
    bool only_useslot = false;
    bool skip_save = false;

    // Clear WiFi config
    if (httpd_query_key_value(buf, "clear", tsmall, sizeof(tsmall) - 1) == ESP_OK && atoi(tsmall)) {
      free(buf);
      cctv_wifi_lock();
      clearWifiConfig();
      g_wifiStatus = "Not connected";
      cctv_wifi_unlock();
      ui_debug_logf("[WiFiCfg] clear requested from UI");
      httpd_resp_set_type(req, "application/json");
      httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
      return httpd_resp_sendstr(req, "{\"ok\":true,\"msg\":\"WiFi config cleared\"}");
    }

    // Lock WiFi for all state-modifying operations (delslot, globals, save).
    // Prevents race with wifiStationBackgroundTask reading globals/slots.
    cctv_wifi_lock();

    if (httpd_query_key_value(buf, "delslot", tsmall, sizeof(tsmall) - 1) == ESP_OK &&
        strlen(tsmall) > 0) {
      const int ds = atoi(tsmall);
      if (ds >= 0 && ds <= 2) {
        cctv_wifi_delete_slot((uint8_t)ds);
        cctv_wifi_apply_preferred_or_first_globals();
        only_delslot = true;
        skip_save = true;
        ui_debug_logf("[WiFiCfg] deleted profile slot=%d", ds);
      }
    }

    if (httpd_query_key_value(buf, "reconnect", tsmall, sizeof(tsmall) - 1) == ESP_OK && atoi(tsmall))
      doReconnect = true;

    if (httpd_query_key_value(buf, "useslot", tsmall, sizeof(tsmall) - 1) == ESP_OK &&
        strlen(tsmall) > 0) {
      only_useslot = true;
      skip_save = true;
      doReconnect = false;
      const int us = atoi(tsmall);
      if (us >= 0 && us <= 2 && cctv_wifi_slot_has_profile((uint8_t)us)) {
        cctv_wifi_apply_slot_to_globals((uint8_t)us);
        cctv_wifi_set_preferred_slot((uint8_t)us);
        doReconnect = true;  // switching profile should reconnect to selected one.
        opMsg = "Switched to saved profile slot " + String(us + 1);
        ui_debug_logf("[WiFiCfg] switched to slot=%d ssid='%s' reconnect=yes", us, g_wifiSsid.c_str());
      } else {
        opMsg = "Invalid/empty profile slot";
        ui_debug_logf("[WiFiCfg] switch rejected (invalid/empty slot input='%s')", tsmall);
      }
    }

    int saveSlot = -1;
    if (!only_delslot && httpd_query_key_value(buf, "slot", tsmall, sizeof(tsmall) - 1) == ESP_OK) {
      saveSlot = atoi(tsmall);
      if (saveSlot < 0 || saveSlot > 2) {
        saveSlot = -1;
      }
    }

    if (!only_delslot && !only_useslot) {
      if (httpd_query_key_value(buf, "ssid", qssid, sizeof(qssid) - 1) == ESP_OK)
        g_wifiSsid = urlDecode(qssid);
      if (httpd_query_key_value(buf, "pass", qpass, sizeof(qpass) - 1) == ESP_OK && strlen(qpass) > 0)
        g_wifiPass = urlDecode(qpass);
      if (httpd_query_key_value(buf, "ent", tsmall, sizeof(tsmall) - 1) == ESP_OK)
        g_wifiEnterprise = (atoi(tsmall) != 0);
      if (httpd_query_key_value(buf, "id", qid, sizeof(qid) - 1) == ESP_OK)
        g_wifiIdentity = urlDecode(qid);
      if (httpd_query_key_value(buf, "ep", qep, sizeof(qep) - 1) == ESP_OK && strlen(qep) > 0)
        g_wifiEapPass = urlDecode(qep);
      if (g_wifiEnterprise) {
        g_wifiPass = "";
      } else {
        g_wifiIdentity = "";
        g_wifiEapPass = "";
      }
    }
    free(buf);

    if (!skip_save) {
      if (saveSlot >= 0 && g_wifiSsid.length() > 0) {
        cctv_wifi_save_globals_into_slot((uint8_t)saveSlot);
        cctv_wifi_set_preferred_slot((uint8_t)saveSlot);
        log_i("[WiFi] NVS profile saved slot=%d ssid_len=%u", saveSlot, (unsigned)g_wifiSsid.length());
        ui_debug_logf("[WiFiCfg] saved profile slot=%d ssid='%s' ent=%s reconnect=%s",
                      saveSlot, g_wifiSsid.c_str(), g_wifiEnterprise ? "yes" : "no",
                      doReconnect ? "yes" : "no");
      } else {
        saveWifiConfig();
        if (g_wifiSsid.length() > 0) {
          ui_debug_logf("[WiFiCfg] saved profile auto-slot ssid='%s' ent=%s reconnect=%s",
                        g_wifiSsid.c_str(), g_wifiEnterprise ? "yes" : "no",
                        doReconnect ? "yes" : "no");
        }
      }
    }
    cctv_wifi_unlock();

    // Naya profile save hua — background task ko wapas try karne do
    { extern volatile bool g_wifiRetryExhausted; g_wifiRetryExhausted = false; }

    if (doReconnect) {
      g_wifiStatus = "Reconnecting...";
      ui_debug_logf("[WiFiCfg] reconnect task scheduled");
      xTaskCreate([](void*){
        vTaskDelay(600 / portTICK_PERIOD_MS);
        cctv_wifi_lock();
        const bool ok = cctv_wifi_try_connect_profiles(18000);
        cctv_wifi_unlock();
        if (ok) {
          g_wifiStatus = "Connected: " + WiFi.localIP().toString();
          log_i("[WiFi] Connected %s (no reboot)", WiFi.localIP().toString().c_str());
          ui_debug_logf("[WiFiCfg] reconnect success ip=%s rssi=%d",
                        WiFi.localIP().toString().c_str(), WiFi.RSSI());
          cctv_time_kick_sync_if_needed(true);
        } else {
          g_wifiStatus = "Failed: " + String(WiFi.status());
          ui_debug_logf("[WiFiCfg] reconnect failed wl=%d (%s)",
                        (int)WiFi.status(), cctv_wifi_status_str(WiFi.status()));
        }
        vTaskDelete(NULL);
      }, "WifiRC", 6144, NULL, 2, NULL);
    }
  } else {
    // no query string — buf was never allocated
  }

  const String ethIp = cctv_eth_ip_string();
  const String wfIp = cctv_wifi_ip_string();
  const wl_status_t liveWifiState = WiFi.status();
  String liveWifiStatus = g_wifiStatus;
  if (wfIp.length() > 0) {
    liveWifiStatus = "Connected: " + wfIp;
  } else if (liveWifiState == WL_CONNECTED) {
    liveWifiStatus = "Connected";
  } else if (liveWifiStatus.startsWith("Connected")) {
    // Avoid stale "Connected" when WiFi is down and no STA IPv4 is present.
    liveWifiStatus = String("Not connected (") + String((int)liveWifiState) + ")";
  }

  String resp = "{";
  resp += "\"ssid\":\"";
  append_json_escaped(resp, g_wifiSsid);
  resp += "\",";
  resp += "\"enterprise\":" + String(g_wifiEnterprise ? "true" : "false") + ",";
  resp += "\"identity\":\"";
  append_json_escaped(resp, g_wifiIdentity);
  resp += "\",";
  resp += "\"passSet\":" + String(g_wifiPass.length() > 0 ? "true" : "false") + ",";
  resp += "\"eapPassSet\":" + String(g_wifiEapPass.length() > 0 ? "true" : "false") + ",";
  resp += "\"status\":\"";
  append_json_escaped(resp, liveWifiStatus);
  resp += "\",";
  resp += "\"ip\":\"" + cctv_primary_local_ip().toString() + "\",";
  resp += "\"ethIp\":\"" + ethIp + "\",";
  resp += "\"wifiIp\":\"" + wfIp + "\",";
  resp += "\"ethLink\":" + String(cctv_eth_link_up() ? "true" : "false");
  resp += ",\"msg\":\"";
  append_json_escaped(resp, opMsg);
  resp += "\"";
  resp += ",\"prefSlot\":" + String((unsigned)cctv_wifi_preferred_slot());
  resp += ",\"profiles\":" + cctv_wifi_profiles_json_array();
  resp += "}";

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, resp.c_str(), resp.length());
}



