karpus2807/esp32-s3/app_httpd.cpp
  httpd_uri_t auth_status_uri = {
    .uri = "/api/auth/status",
    .method = HTTP_GET,
    .handler = auth_status_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t auth_login_uri = {
    .uri = "/api/auth/login",
    .method = HTTP_GET,
    .handler = auth_login_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t auth_logout_uri = {
    .uri = "/api/auth/logout",
    .method = HTTP_GET,
    .handler = auth_logout_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t auth_change_uri = {
    .uri = "/api/auth/change",
    .method = HTTP_GET,
    .handler = auth_change_password_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t iot_uri = {
    .uri = "/api/iot",
    .method = HTTP_GET,
    .handler = iot_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t iot_save_uri = {
    .uri = "/api/iot/save",
    .method = HTTP_GET,
    .handler = iot_save_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  // Single HTTP server on port 80, Core 1
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  // Default CONFIG_HTTPD_MAX_URI_LEN is 512 — WiFi save uses GET with long URL-encoded
  // passwords; truncation caused silent save failures and broken JSON from the client.
  config.max_uri_len = 2048;
  config.max_uri_handlers = 30;
  config.max_open_sockets = 9;
  config.task_priority = tskIDLE_PRIORITY + 5;
  config.stack_size = 16384;     // download_handler + listCapturesJson need headroom
  config.send_wait_timeout = 30; // 30s timeout for large file downloads
  config.core_id = 1;
  // DO NOT use PSRAM stack for httpd — wifi_handler / cmd_handler do NVS flash writes
  // (Preferences::putString). On ESP32-S3 OPI-PSRAM the MSPI bus is shared; flash writes
  // disable cache → PSRAM stack inaccessible → silent write failure (putString returns 0).
  // 16 KB from internal DRAM is fine (~256 KB free at boot).

  log_i("Starting CCTV web server on port %d", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    cctv_ui_log_init();
    cctv_auth_load_creds();
    Serial.printf("[HTTP] httpd_start OK  port=%d  core=%d\n", config.server_port, (int)config.core_id);
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &save_uri);
    httpd_register_uri_handler(camera_httpd, &storage_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);
    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);
    httpd_register_uri_handler(camera_httpd, &stream_uri);
    httpd_register_uri_handler(camera_httpd, &mjpeg_uri);
    httpd_register_uri_handler(camera_httpd, &live_mjpg_uri);
    httpd_register_uri_handler(camera_httpd, &files_uri);
    httpd_register_uri_handler(camera_httpd, &download_uri);
    httpd_register_uri_handler(camera_httpd, &delete_uri);
    httpd_register_uri_handler(camera_httpd, &sysinfo_uri);
    httpd_register_uri_handler(camera_httpd, &wifi_uri);
    httpd_register_uri_handler(camera_httpd, &wifiscan_uri);
    httpd_register_uri_handler(camera_httpd, &reboot_uri);
    httpd_register_uri_handler(camera_httpd, &api_console_uri);
    httpd_register_uri_handler(camera_httpd, &api_logs_uri);
    httpd_register_uri_handler(camera_httpd, &auth_status_uri);
    httpd_register_uri_handler(camera_httpd, &auth_login_uri);
    httpd_register_uri_handler(camera_httpd, &auth_logout_uri);
    httpd_register_uri_handler(camera_httpd, &auth_change_uri);
    httpd_register_uri_handler(camera_httpd, &iot_uri);
    httpd_register_uri_handler(camera_httpd, &iot_save_uri);
    return true;
  }
  Serial.printf("[HTTP] httpd_start FAILED (check port 80 in use / lwIP)\n");
  return false;
}
void setupLedFlash() {
#if defined(LED_GPIO_NUM)
  ledcAttach(LED_GPIO_NUM, 5000, 8);
#else
  log_i("LED flash is disabled -> LED_GPIO_NUM undefined");
#endif
}
